[
  {
    "id": "blitzscaling-heuristic-001",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Blitzscaling means prioritising speed over efficiency in an environment of uncertainty. It's only sensible when speed into market is critical for massive outcomes and the risk of being too slow exceeds the risk of inefficiency.",
    "rationale": "In winner-take-all markets, first-scaler advantage creates network effects and lock-in. Moving slowly lets competitors capture the market. Blitzscaling is intentional inefficiency to win.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["market:winner-take-all", "signal:network-effects-possible"],
    "breaks_when": ["market:stable", "advantage:no-first-scaler-benefit"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-002",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Maximise four growth factors: market size (large TAM), distribution (reaching customers efficiently), high gross margins (cash to fund growth), and network effects (usage increases value for others).",
    "rationale": "Network effects are most crucial—they create superlinear growth and customer lock-in. High margins fund the aggressive investment blitzscaling requires. Distribution beats product quality.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["stage:pre-scale", "goal:hypergrowth"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-003",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "A good product with great distribution almost always beats a great product with poor distribution. Many startups overlook this, focusing only on product while neglecting how to reach customers.",
    "rationale": "Dropbox excelled due to distribution, not just product. Distribution can leverage existing networks (PayPal on eBay) or virality (users bringing users). Retention is critical for virality to work.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Channel",
    "applies_when": ["stage:early", "constraint:limited-marketing-budget"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-pattern-001",
    "source": "Blitzscaling",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Five categories of network effects: direct (more users = more value), indirect (usage encourages complements), two-sided (one group's usage benefits another), local (value within subset), and compatibility/standards.",
    "rationale": "Network effects both produce and require aggressive growth. Companies must pass a tipping point for value to kick in. At low scale, network effects can exert downward pressure.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["goal:defensibility", "market:platform-potential"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-failuremode-001",
    "source": "Blitzscaling",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Lack of product/market fit is the most critical growth limiter. Without it, growth is expensive and difficult, and well-run companies can still fail. Don't blitzscale before achieving it.",
    "rationale": "Marc Andreessen defined it as being in a good market with a product that can satisfy that market. Blitzscaling before fit means burning capital on something nobody wants.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["stage:pre-PMF"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-failuremode-002",
    "source": "Blitzscaling",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Premature blitzscaling ('blitzfailing') can destroy a nascent market. Webvan's failure poisoned grocery delivery for years. The ultimate prize must justify the high costs and risks.",
    "rationale": "Blitzscaling requires a big new opportunity with first-scaler advantage potential. Without these conditions, aggressive spending creates catastrophic losses and scares away future investors.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:unproven-market", "stage:pre-PMF"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-004",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Hire Ms. Right Now, not Ms. Right. Prioritise managers who are right for the current phase, even if they might not scale to the next. Don't hire a manager of 1000 for a 10-person company.",
    "rationale": "The primary concern is current value. 'Scalability' is secondary. Different stages require different skills. Knowing when to let someone go is part of this rule.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["stage:hypergrowth", "constraint:speed-priority"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-005",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Launch a product that embarrasses you. Prioritise speed to market with an imperfect product over a slow, 'perfect' launch. Early launch enables rapid feedback and faster learning curve iteration.",
    "rationale": "LinkedIn launched MVP with minimal features, then used data to improve virality. The key is fixable flaws, not fatal ones. Don't endanger customers or reputation.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Sequencing",
    "applies_when": ["stage:early", "goal:learning"],
    "breaks_when": ["risk:safety-critical", "market:regulated"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-006",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Let fires burn. In blitzscaling, there are always more problems than resources. Prioritise fighting fires that threaten existence or growth. Consciously ignore less urgent fires.",
    "rationale": "PayPal ignored customer service issues initially to focus on fundraising and competition. Hierarchy of fires: distribution > product > revenue model > operations > competition > what's next.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["stage:hypergrowth", "constraint:resource-limited"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-heuristic-007",
    "source": "Blitzscaling",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Do things that don't scale (throwaway work). Inefficiency is the rule when it allows faster market entry and learning. Each stage involves work that's necessary for speed but will be discarded.",
    "rationale": "Airbnb's photography evolved from founders doing it personally, to freelancers on spreadsheets, to automated software. Each stage was throwaway work necessary for that moment's speed.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["stage:early", "goal:speed-over-efficiency"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-signal-001",
    "source": "Blitzscaling",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Leading indicators to stop blitzscaling: declining rate of growth relative to market, worsening unit economics, decreasing per-employee productivity, increasing management overhead.",
    "rationale": "Blitzscaling is not permanent; no market is infinite. Continuing in a mature market leads to crashing into a ceiling. Groupon suffered turmoil when its market suddenly stopped growing.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["stage:scaling", "signal:growth-slowing"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-pattern-002",
    "source": "Blitzscaling",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Founder role transforms with scale: Stage 1 personally pulls levers, Stage 2 manages people pulling levers, Stage 3 designs organisation, Stage 4 makes high-level decisions, Stage 5 starts new blitzscaling efforts.",
    "rationale": "Few early employees can scale with the company. Setting correct expectations up front is crucial. The job description for founders constantly changes with each growth phase.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["stage:scaling"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "blitzscaling-example-001",
    "source": "Blitzscaling",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "PayPal blitzscaled before solving its business model, trusting that growth would create necessary leverage. Used $10 referral bonuses for viral distribution, then built monetisation later.",
    "rationale": "Demonstrated that in winner-take-all markets, achieving scale can precede profitability. Growth created bargaining power with eBay and merchants that funded the business model.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "strength": "High",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1999, "end_year": 2002 },
    "outcome": "Worked",
    "context": ["fintech", "marketplace", "network-effects"]
  },
  {
    "id": "blitzscaling-example-002",
    "source": "Blitzscaling",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon turned operational scalability from a limiter into competitive advantage by shifting from outsourcing logistics to becoming a leading infrastructure company with AWS and mastering fulfilment.",
    "rationale": "AWS (high-margin SaaS) contributes 150% of Amazon's operating income, fuelling investment in low-margin retail. World-class logistics enables Prime's speed advantage.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "strength": "High",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1994, "end_year": 2018 },
    "outcome": "Worked",
    "context": ["e-commerce", "cloud", "logistics"]
  },
  {
    "id": "blitzscaling-failuremode-003",
    "source": "Blitzscaling",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Organisational growth not keeping pace with revenue and customer growth can be fatal. Oracle nearly went bankrupt in late 1980s from single-minded sales growth while neglecting technology and finance.",
    "rationale": "Successful blitzscaling requires reinvention of leadership style, product, and organisation at each new phase. Management must keep pace with business growth or chaos becomes destructive.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["stage:hypergrowth", "signal:management-lagging"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

