[
  {
    "id": "innovation-and-entrepreneurship-heuristic-001",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Systematic innovation begins with analysing seven sources of opportunity: unexpected events, incongruities, process needs, industry/market changes, demographics, perception changes, and new knowledge.",
    "rationale": "The overwhelming majority of successful innovations exploit changes that have already occurred. Systematic search across these sources is more reliable than waiting for flashes of genius or bright ideas.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["context:opportunity-search", "stage:ideation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-002",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Unexpected success is the richest and least risky source of innovative opportunity. It signals underlying changes that often go unnoticed or are actively resisted by management.",
    "rationale": "Management often resists unexpected success because it challenges their judgment and preconceived notions of what is 'normal' for the business. Systematic processes are needed to surface and analyse these events.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["signal:unexpected-success", "context:product-performance"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-signal-001",
    "source": "Innovation and Entrepreneurship",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "An incongruity between rising demand and declining profitability in an industry signals a 'fault' in the process that creates opportunity for innovation with simple, feasible solutions.",
    "rationale": "When economic performance doesn't match growth, something in the industry structure is broken. Innovations exploiting this need simple solutions using existing knowledge, not new research.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["signal:demand-profit-mismatch", "market:growing"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-failuremode-001",
    "source": "Innovation and Entrepreneurship",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Producers often misinterpret what customers actually buy and value due to intellectual arrogance or dogmatism. This incongruity between perceived and actual customer values creates opportunity for competitors.",
    "rationale": "The securities firm selling 'peace of mind' instead of financial gain exemplifies this. Listening to customers rather than assuming you know their values reveals these gaps.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["signal:customer-dissatisfaction", "culture:producer-focused"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-003",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Process need innovation addresses a weak or missing link in an existing process. The need is often known but action delayed until an innovation appears—then it's immediately accepted.",
    "rationale": "Successful process-need innovations require: self-contained process, clear weak link, defined specifications, high user receptivity, and knowledge available within existing state of the art.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Architecture",
    "applies_when": ["signal:process-friction", "context:known-pain-point"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-pattern-001",
    "source": "Innovation and Entrepreneurship",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Four indicators signal impending industry structural change: rapid growth outpacing economy, 'creaming' the market, convergence of technologies, and rapid changes in how business is conducted.",
    "rationale": "Industries growing significantly faster than the economy are highly likely to undergo structural change as existing practices become obsolete. Outsiders often perceive these as opportunities, not threats.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["market:rapid-growth", "signal:convergence"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-004",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Demographic changes are the clearest and most predictable external source of innovation with known lead times. Decision-makers who assume population stability miss these opportunities.",
    "rationale": "Demographics significantly influence what is bought, by whom, and in what quantities. While shifts are sudden, they have predictable lead times (birth to kindergarten age) creating windows for prepared entrepreneurs.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["signal:demographic-shift", "context:planning-horizon"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-failuremode-002",
    "source": "Innovation and Entrepreneurship",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Knowledge-based innovation has the longest lead time (25-35 years) and requires convergence of several different kinds of knowledge. Innovation is premature if all needed knowledges haven't converged.",
    "rationale": "Hybrid corn, airplane, computer all required convergence of multiple knowledge areas. Meticulous analysis is needed to identify missing factors. Failure to analyse often leads to losing the innovation's fruits.",
    "lens": ["Feasibility"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["type:knowledge-based-innovation", "stage:early"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-failuremode-003",
    "source": "Innovation and Entrepreneurship",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Bright-idea innovations have extremely high casualty rates with very few patents earning enough to cover development costs. There is no predictable system for generating successful ones.",
    "rationale": "Bright ideas are often vague and elusive, making it difficult to define the need they satisfy. Entrepreneurs should focus on innovations from systematic analysis of the seven sources rather than relying on bright ideas.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:idea-without-analysis"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-005",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Effective innovations are simple and focused, doing one specific thing well. They should start small, require limited resources, target a small market initially, yet aim at achieving leadership.",
    "rationale": "Simplicity avoids confusion and facilitates implementation. Starting small allows for adjustments and learning. Even small innovations should aim at dominance within their chosen environment.",
    "lens": ["Business"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:launch", "constraint:resource-limited"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-006",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "New ventures often succeed in markets unintended by founders. They must be totally market-focused to identify and exploit unexpected opportunities, with products defined by customers, not producers.",
    "rationale": "3M's Scotch Tape, Novocain in dentistry, bicycle engines for irrigation pumps—innovators often miss unexpected markets while others capitalise. Market research is insufficient; continuous experimentation and listening required.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["stage:early", "signal:unexpected-interest"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-failuremode-004",
    "source": "Innovation and Entrepreneurship",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Rapidly growing ventures with 'profits' can still face cash crises because growth demands adding financial resources rather than taking them out. Lack of financial focus is a major threat.",
    "rationale": "Growth requires feeding, not harvesting. Reliable cash flow analysis, forecasts, and management are essential. New ventures outgrow their capital structure as they grow and need to plan ahead.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["stage:growth", "signal:rapid-scaling"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-pattern-002",
    "source": "Innovation and Entrepreneurship",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Entrepreneurial judo exploits established leaders' bad habits: NIH (Not Invented Here), 'creaming' the market, focusing on 'quality' over customer value, premium pricing, and maximising instead of optimising.",
    "rationale": "This strategy uses the leader's own weaknesses against them. It requires securing a beachhead in neglected segments before expanding, and offering something distinct beyond just cheaper pricing.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["market:incumbent-dominated", "signal:underserved-segment"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-007",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Toll-gate strategy occupies a position where a product is essential to a process and cost of not using it vastly exceeds price, while total market is too small to attract competitors.",
    "rationale": "This creates practical monopoly. But the strategist must not exploit the monopoly—must provide excellent service and constantly improve the product. Position is largely static with limited growth potential.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["market:niche", "product:essential-component"],
    "breaks_when": ["market:grows-large"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovation-and-entrepreneurship-heuristic-008",
    "source": "Innovation and Entrepreneurship",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Price what the customer buys (a shave, a copy) rather than what the manufacturer sells (a razor, a machine). Structure payment to fit the customer's reality.",
    "rationale": "King Gillette and Xerox exemplify this. Moving from product to system by selling what the product does for the customer (operating time, productivity) delivers true value from the customer's perspective.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["goal:customer-value", "context:pricing-strategy"],
    "strength": "High",
    "evidence_grade": "Secondary"
  }
]

