[
  {
    "id": "moats-heuristic-001",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "An economic moat represents a sustainable competitive advantage that allows a company to generate superior returns on invested capital for an extended period, protecting its long-term profitability and market share from competitive forces. True moats are structural and enduring, making them inherently difficult for competitors to replicate or erode.",
    "rationale": "Companies with strong moats can consistently outperform peers and the broader market, even when facing significant competitive pressure or economic downturns. A high market share, popular product, or temporary technological lead does not automatically equate to a moat.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["competitive-advantage:evaluating", "investment:analyzing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-002",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "A company that consistently generates Return on Invested Capital (ROIC) significantly above its cost of capital is typically demonstrating the existence of an economic moat. This persistent excess return indicates that competitive forces are not driving returns down to the cost of capital.",
    "rationale": "ROIC is widely considered the most important quantitative measure of an economic moat's existence and strength. It directly measures how effectively a company is using all of its capital to generate profits.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["moat:measuring", "investment:screening"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-003",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Network effects represent one of the most powerful moats in the digital age. A network effect occurs when the value of a product or service increases for existing users as more users join the network, creating a self-reinforcing loop where growth begets more growth.",
    "rationale": "This creates an almost impenetrable barrier once a dominant network is established. The first-mover advantage here is substantial, as reaching critical mass creates an almost insurmountable barrier for new entrants.",
    "lens": ["Business", "Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["platform:building", "network:evaluating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-004",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Switching costs create an economic moat by making it difficult or expensive for customers to change from one provider to another. When customers face significant time, effort, or financial penalties to switch, they are more likely to remain, providing stable customer base and pricing power.",
    "rationale": "The higher the switching costs, the stronger the moat. This 'stickiness' means customers are less sensitive to minor price increases, enabling premium pricing and predictable revenue.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Value",
    "applies_when": ["retention:designing", "pricing:strategy"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-005",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Intangible assets (brand recognition, patents, regulatory licenses, proprietary technology, corporate culture) provide competitive edge that is difficult for competitors to replicate or acquire. Unlike physical assets, their value often grows with use and recognition.",
    "rationale": "A strong, trusted brand allows premium pricing and deep customer loyalty. Patents and regulatory licenses create legal barriers. Proprietary technology is difficult to reverse-engineer.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Value",
    "applies_when": ["brand:building", "ip:protecting"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-006",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Cost advantage moat allows a company to produce goods or services at a lower cost than competitors, enabling either lower prices to gain market share or higher profit margins at competitive prices. This is particularly powerful in commodity-like industries where price is the primary driver.",
    "rationale": "Sources include economies of scale, proprietary processes, preferential access to inputs, geographic location, superior technology, and learning curve effects. Achieving sustainable cost advantage requires deep operational efficiency that rivals cannot easily replicate.",
    "lens": ["Business", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["operations:optimizing", "pricing:competing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-heuristic-007",
    "source": "Economic Moats Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Efficient scale moat applies to industries where a limited market size can only support one or very few profitable competitors. Once a company reaches efficient scale, any new entrant would face prohibitively high costs or severe market saturation.",
    "rationale": "Often seen in niche markets or industries with high fixed costs where adding a second competitor would effectively destroy profitability for both. Natural monopolies and geographic specificity are key characteristics.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["market:niche", "scale:evaluating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-failuremode-001",
    "source": "Economic Moats Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "A great product is often necessary for business success, but it is not a moat in itself. Product superiority can be quickly replicated, improved upon, or commoditized by competitors. Without an underlying structural barrier, even a revolutionary product can see its profits eroded rapidly.",
    "rationale": "If the answer to 'why can't it be copied?' is just 'it's better,' it's probably not a moat. Focus on the 'how' of creating high switching costs, network effects, or unique cost advantages.",
    "lens": ["Business"],
    "level": "Product",
    "dimension": "Value",
    "applies_when": ["product:launching", "moat:evaluating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-failuremode-002",
    "source": "Economic Moats Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Brand power can be overestimated if not supported by other structural advantages. A strong brand allows pricing power and customer preference, but in an era of abundant information and choice, loyalty can be fickle. If brand isn't backed by switching costs, network effects, or cost advantage, it can be vulnerable.",
    "rationale": "Examine if the brand can genuinely command significant premium over unbranded alternatives. Assess if customers remain loyal when cheaper or more convenient options arise. Distinguish brand from fad.",
    "lens": ["Customer", "Business"],
    "level": "Strategy",
    "dimension": "Value",
    "applies_when": ["brand:evaluating", "moat:assessing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-failuremode-003",
    "source": "Economic Moats Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Many factors can give a company temporary advantage—fleeting market trend, short-term supply chain disruption for competitors, burst of marketing spending. The mistake is interpreting these as durable moats. True moats are structural and enduring. Temporary advantages inevitably fade.",
    "rationale": "High market share without underlying moat can be achieved through aggressive pricing or temporary fads. First-mover advantage without network effects is only temporary. Exceptional management team alone is not a moat—they can leave.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Process",
    "applies_when": ["advantage:evaluating", "moat:distinguishing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-failuremode-004",
    "source": "Economic Moats Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "No moat is absolutely impregnable. A critical mistake is assuming that a moat, once built, will last forever without continuous reinforcement and adaptation. Technological disruption, shifting consumer preferences, and aggressive competitive innovation can all erode even the strongest moats. Complacency is the enemy.",
    "rationale": "Requires regular moat audits, monitoring competitive landscape, continuous investment in R&D, brand, and retention. Must anticipate disruption and be willing to evolve the business model.",
    "lens": ["Business", "Feasibility"],
    "level": "Strategy",
    "dimension": "Process",
    "applies_when": ["moat:maintaining", "disruption:anticipating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-failuremode-005",
    "source": "Economic Moats Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "A great company with a strong moat can still be a poor investment if its stock price already reflects or overstates the value of that moat. The goal is finding moated companies trading at a discount to intrinsic value, or at least at fair price allowing for future appreciation.",
    "rationale": "Perform valuation analysis. Compare to peers. Model different scenarios. Buy at price significantly below calculated intrinsic value to provide margin of safety. Even with strong moat, short-term overvaluation leads to disappointing returns.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["investment:deciding", "valuation:assessing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-pattern-001",
    "source": "Economic Moats Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Five primary sources of durable competitive advantage (moats): (1) Intangible Assets (brand, patents, licenses), (2) Switching Costs, (3) Network Effects, (4) Cost Advantage (scale, process, access), (5) Efficient Scale (limited market supports few competitors).",
    "rationale": "Framework articulated by Morningstar. Companies often possess more than one type of moat, creating multi-layered defense. Each type describes a different structural barrier that inhibits competitors from replicating success.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["moat:identifying", "strategy:planning"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-pattern-002",
    "source": "Economic Moats Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Building network effect moats requires: subsidizing early users, targeting niche segments before expanding, facilitating user-to-user interaction, attracting one side of two-sided market to attract the other, allowing third-party developers to build on platform, using data to improve product, rapid iteration.",
    "rationale": "This is often an 'all or nothing' game—if platform fails to reach critical mass, the network effect won't materialize. Once achieved, the network becomes self-sustaining and incredibly difficult for competitors to dislodge.",
    "lens": ["Business", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["platform:building", "network:growing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-pattern-003",
    "source": "Economic Moats Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Ecosystem moats: Create interconnected set of products, services, and partners that mutually reinforce each other's value. Creates powerful lock-in effect—switching away means abandoning significant portion of integrated digital/physical life. Strength lies in complexity and compounding value.",
    "rationale": "Apple exemplifies this: iOS optimized for Apple devices, App Store network effect, iCloud lock-in, proprietary chips, brand status, high switching costs, unique retail experience. Each component adds value to others.",
    "lens": ["Business", "Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["ecosystem:building", "lock-in:creating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-pattern-004",
    "source": "Economic Moats Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Porter's Value Chain Analysis for moat creation: Map all primary and support activities, analyze cost drivers within each activity, pinpoint activities creating unique value for customers, understand how activities are connected, benchmark against competitors, direct resources to activities contributing most to moats.",
    "rationale": "Helps companies dissect operations to pinpoint where competitive advantages can be created. Optimizing inbound logistics might lead to cost advantage; exceptional customer service could enhance brand or create switching costs.",
    "lens": ["Business", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["operations:analyzing", "moat:building"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-signal-001",
    "source": "Economic Moats Guide",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Key indicators of potential moat: High profit margins consistently above competitors, high returns on capital sustained over many years, ability to raise prices without significant market share loss, consistent or growing market share despite competitive pressure, high customer retention rates, low capital expenditures relative to peers.",
    "rationale": "Ask 'why' a company is successful and whether that 'why' is defensible. High ROIC above WACC for extended period is hallmark of moated companies.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["moat:screening", "investment:analyzing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-signal-002",
    "source": "Economic Moats Guide",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "For evaluating switching cost moats: Track customer churn rate, customer retention rate, average customer lifetime, Customer Lifetime Value (CLTV), Net Promoter Score (NPS). Lower churn implies stronger switching costs.",
    "rationale": "A low churn rate indicates customers find it difficult, costly, or undesirable to switch to competitors, which is the essence of a switching cost moat.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["retention:measuring", "switching-costs:evaluating"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-example-001",
    "source": "Economic Moats Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Apple ecosystem moat: Tightly integrated hardware, software, and services creating seamless user experience difficult to replicate outside Apple universe. iOS/macOS optimized for Apple devices, App Store network effect, iCloud lock-in, proprietary chips providing performance advantage, iconic brand, high switching costs from data/apps/learning curve.",
    "rationale": "Decades of consistent product quality and aspirational marketing have cultivated deep customer loyalty and willingness to pay premium. Multiple moat types layered together.",
    "lens": ["Business", "Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["technology", "ecosystem", "consumer"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-example-002",
    "source": "Economic Moats Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Google search moat: Network effect where more users mean more data, which refines algorithm, leading to better search results, attracting more users. Proprietary algorithms constantly evolving. Massive data advantage from user queries and browsing behavior. Google Ads creates two-sided market. 'Googling' as verb demonstrates ubiquity.",
    "rationale": "The unparalleled user base attracts advertisers, creating two-sided market network effect. Android OS expands data collection and network reach. YouTube adds another layer of network effects.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["technology", "platform", "data"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-example-003",
    "source": "Economic Moats Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Coca-Cola moat: Iconic brand with unparalleled global recognition allowing premium pricing. Closely guarded proprietary syrup formula. Massive distribution network ensuring ubiquitous product availability at incredibly low per-unit cost. Economies of scale in marketing. Consumer habit deeply ingrained. Shelf space dominance.",
    "rationale": "Decades of consistent marketing and presence have built brand that evokes trust and familiarity. Combination of intangible asset (brand) and cost advantage (distribution) creates wide, durable moat evident in consistent profitability over more than a century.",
    "lens": ["Business", "Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["consumer-goods", "brand", "distribution"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-example-004",
    "source": "Economic Moats Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon multi-layered moat: Cost advantage from massive scale, efficient logistics, automation. Amazon Prime creates high switching costs by bundling free shipping, streaming, and other benefits. Marketplace network effect where more buyers attract more sellers and vice versa. AWS has separate moat from enterprise switching costs. Customer obsession driving loyalty.",
    "rationale": "Relentless focus on efficiency, massive fulfillment infrastructure, and pioneering services like Prime created highly sticky customer base. Brand trust in e-commerce. Data-driven optimization for personalization.",
    "lens": ["Business", "Customer"],
    "level": "Strategy",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["ecommerce", "platform", "cloud"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "moats-example-005",
    "source": "Economic Moats Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Waste Management Inc. moat: Efficient scale in localized markets—high fixed costs for landfills and collection infrastructure make it uneconomical for multiple players. Strict regulatory barriers and permitting processes for landfills create entry barriers. Geographic lock-in once routes optimized. Long-term contracts with municipalities provide stable revenue.",
    "rationale": "Once necessary infrastructure obtained and permits secured, company becomes most efficient and often only viable player in given geographic area. New entrant would face immense logistical and capital challenges.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["utilities", "local-monopoly", "regulatory"],
    "strength": "High",
    "evidence_grade": "Secondary"
  }
]

