[
  {
    "id": "innovators-dilemma-heuristic-001",
    "source": "The Innovator's Dilemma",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Give responsibility for disruptive technologies to organizations whose customers need them. Create independent organizations whose survival depends on serving emerging customers of the disruptive technology, not existing mainstream customers.",
    "rationale": "In well-managed companies, customer demands effectively dictate where resources are allocated. Resource allocation processes inherently favor sustaining projects that existing customers want. Aligning disruptive projects with the force of customer demand requires independent organizations.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-technology", "stage:commercialization"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-heuristic-002",
    "source": "The Innovator's Dilemma",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Match the size of the organization to the size of the market. Implant disruptive technology projects in small organizations whose success is meaningfully impacted by the venture—large companies struggle to invest meaningfully in small emerging markets.",
    "rationale": "Large companies need increasingly large revenue chunks to maintain growth rates. Emerging disruptive markets are initially too small to matter to large companies. This leads them to wait until 'large enough to be interesting,' missing the crucial window for establishing position.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["company-size:large", "market:emerging"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-heuristic-003",
    "source": "The Innovator's Dilemma",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "For disruptive innovation, create plans to learn rather than plans to execute. Assume forecasts for disruptive technologies are wrong. The market must be discovered through experimentation and trial and error, not traditional market research.",
    "rationale": "Market research techniques that work well for established markets fail spectacularly for emerging markets. The information needed for decisive investment doesn't exist initially. Successful ventures survive by failing early and inexpensively and having resources to try again.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-technology", "stage:market-discovery"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-heuristic-004",
    "source": "The Innovator's Dilemma",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "When performance oversupply occurs—when technology improves faster than market demand—customers stop valuing further improvement in that dimension and the basis of competition shifts to other attributes like convenience, reliability, or price.",
    "rationale": "In disk drives, when capacity exceeded desktop needs, customers no longer prioritized capacity. The shift follows a predictable hierarchy: functionality, then reliability, then convenience, then price. Disruptive technologies often herald these shifts, emerging at the low end.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["signal:performance-oversupply", "market:mature"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-heuristic-005",
    "source": "The Innovator's Dilemma",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Organizational capabilities lie in processes and values, not just resources. Processes define how things are done consistently. Values reflect the business model's prioritization criteria. Both can become disabilities when the context changes to disruptive innovation.",
    "rationale": "Resources alone don't determine capability. Processes and values developed for mainstream success render organizations incapable with disruptive technologies because disruptive innovations promise lower margins and aren't valued by core customers, making them inconsistent with established values.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:organizational-change"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-failuremode-001",
    "source": "The Innovator's Dilemma",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Established firms are held captive by their customers. When lead customers show little interest in disruptive technology prototypes, marketing generates pessimistic forecasts, finance recommends against investment, and resources flow to sustaining projects instead.",
    "rationale": "Resource allocation processes driven by mainstream customers' demands starve disruptive projects. Mid-level managers champion projects with assured market demand and perceive disruptive projects as risky. Even when senior management desires to pursue disruptive technology, embedded processes resist.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["signal:customer-feedback-negative", "context:disruptive-technology"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-failuremode-002",
    "source": "The Innovator's Dilemma",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Companies can readily move upmarket toward higher performance and margins but struggle to move downmarket. This asymmetry is driven by rational resource allocation processes—upmarket appears more profitable while downmarket appears unattractive given existing cost structures.",
    "rationale": "Moving to higher-margin value networks allows companies to leverage existing cost structures. Moving downmarket is challenging because high-cost structures make it difficult to be profitable competing against companies with lower-cost structures honed for those margins.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["signal:upmarket-drift", "signal:downmarket-opportunity"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-failuremode-003",
    "source": "The Innovator's Dilemma",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Disruptive technology is a marketing challenge, not a technology challenge. The failure is in finding or creating a new market that values the technology's current attributes, not in improving the technology to fit existing markets.",
    "rationale": "Engineers often develop disruptive prototypes internally. The technology exists. But because it doesn't meet existing customer needs, the market must be discovered through experimentation. Traditional market research is unreliable for non-existent markets.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["context:disruptive-technology"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-pattern-001",
    "source": "The Innovator's Dilemma",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Disruptive technologies' weaknesses in mainstream markets are their strengths in emerging markets. The attributes making them uncompetitive (smaller size, lower capacity, simpler) are valued in new applications where those are features, not bugs.",
    "rationale": "Disruptive products tend to be simpler, less expensive, and more reliable and convenient than established products. They challenge mainstream products that have overshot market needs. Finding markets where current attributes are strengths is key to initial market discovery.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:disruptive-technology", "stage:market-discovery"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-pattern-002",
    "source": "The Innovator's Dilemma",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "In disruptive innovation, leadership in creating new markets is highly advantageous—companies entering early generated vastly more cumulative revenue than later entrants. In sustaining innovation, there was no lasting competitive advantage from leading.",
    "rationale": "Success in disruptive innovation is strongly correlated with being a leader in creating and entering the new market, not just developing the technology. Waiting until a market is 'large enough to be interesting' means missing the window to establish position.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:disruptive-technology"],
    "breaks_when": ["context:sustaining-technology"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-dilemma-example-001",
    "source": "The Innovator's Dilemma",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "IBM succeeded with personal computers by creating an autonomous organization in Florida, separate from its mainstream operations. This allowed it to succeed despite the PC being disruptive to IBM's core business model of high-margin proprietary systems.",
    "rationale": "IBM's PC Division had different cost structures, sales channels, and values than the mainframe business. Independence from the mainstream allowed it to develop processes appropriate for the PC market without being constrained by IBM's established ways of working.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-technology", "company-size:large"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1981, "end_year": 1985 },
    "outcome": "Worked",
    "context": ["enterprise", "disruptive-technology"]
  },
  {
    "id": "innovators-dilemma-example-002",
    "source": "The Innovator's Dilemma",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Digital Equipment Corporation repeatedly failed to establish a personal computer business because it tried to manage these ventures within its mainstream organization, where the PC didn't fit existing cost structure, customer demands, or resource allocation priorities.",
    "rationale": "DEC had skilled engineers, cash, and technology (resources), but its processes for designing, manufacturing, and selling minicomputers were fundamentally different from those required for PCs. Its values prioritized high-margin products, making lower-margin PCs consistently lower priority.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-technology", "structure:integrated-org"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1982, "end_year": 1995 },
    "outcome": "Failed",
    "context": ["enterprise", "disruptive-technology"]
  },
  {
    "id": "innovators-dilemma-example-003",
    "source": "The Innovator's Dilemma",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Honda's success in North America came from accidentally discovering a new market for small Supercub bikes in off-road recreation, not from their planned strategy to sell large highway motorcycles. The initial strategy failed completely.",
    "rationale": "Honda's discovery was made when executives used small Supercubs personally and noticed unexpected demand. This led to a new value network for off-road recreational motorbiking where small size, lightweight, and ruggedness were valued—attributes that were weaknesses for highway use.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["context:market-discovery", "signal:unexpected-customer-behavior"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1959, "end_year": 1965 },
    "outcome": "Worked",
    "context": ["consumer", "market-discovery"]
  },
  {
    "id": "innovators-dilemma-example-004",
    "source": "The Innovator's Dilemma",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Intuit's Quickbooks disrupted accounting software by offering simpler functionality designed for non-accountants. Existing software had overshot small business needs with excessive functionality; Quickbooks shifted competition to convenience, rapidly capturing market share.",
    "rationale": "Existing accounting software was designed for accountants and offered excessive functionality for small business owners who lacked accounting knowledge. This performance oversupply created an opportunity for a simpler, more convenient alternative that was 'good enough.'",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["signal:performance-oversupply", "audience:non-experts"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1992, "end_year": 1998 },
    "outcome": "Worked",
    "context": ["SMB", "disruptive-technology"]
  },
  {
    "id": "innovators-dilemma-example-005",
    "source": "The Innovator's Dilemma",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Minimills like Nucor and Chaparral disrupted integrated steel by starting in low-quality rebar (a market integrated mills were happy to exit), then consistently improving technology and attacking higher-end markets while integrated mills retreated upmarket.",
    "rationale": "Integrated mills' rational focus on high-margin products left lower-end markets to minimills. Minimills' lower capital and operating costs made low-margin rebar profitable. They then improved technology and invaded successively higher-end markets while integrated mills ceded ground.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["context:low-end-disruption", "signal:incumbent-retreat"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1975, "end_year": 1995 },
    "outcome": "Worked",
    "context": ["manufacturing", "disruptive-technology"]
  }
]

