[
  {
    "id": "innovators-solution-heuristic-001",
    "source": "The Innovator's Solution",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Segment markets by the 'jobs' customers are trying to get done, not by product type, price point, or demographics. The functional, emotional, and social dimensions of jobs define true market segments. The critical unit of analysis is the circumstance, not the customer.",
    "rationale": "Traditional segmentation reveals correlations but not causality. Customers 'hire' products for specific jobs. The milkshake example showed morning commuters and evening parents hired the same product for completely different jobs, requiring different improvements.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["stage:market-definition", "goal:product-development"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-heuristic-002",
    "source": "The Innovator's Solution",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use three litmus tests for disruption: (1) Is there a population lacking money, equipment, or skill who went without? (2) Are there overserved customers who'd accept less for lower price? (3) Is it disruptive to ALL significant incumbents?",
    "rationale": "New-market disruptions compete with nonconsumption. Low-end disruptions attack overserved customers. If even one incumbent finds it sustaining, they will likely win. These tests predict competitive outcomes.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["stage:opportunity-assessment", "context:new-venture"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-heuristic-003",
    "source": "The Innovator's Solution",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Good money is patient for growth but impatient for profit. Bad money is impatient for growth but patient for profit. Early profitability validates the business model and forces low fixed costs. Patience for growth allows emergent strategy to evolve.",
    "rationale": "Impatience for growth pressures ventures to target large existing markets rather than small disruptive ones. Patience for profit allows ventures to pursue wrong strategies for too long. Early profitability provides buffer against corporate downturns.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["stage:funding", "context:disruptive-venture"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-heuristic-004",
    "source": "The Innovator's Solution",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Integrate across interfaces where performance is 'not good enough' relative to customer needs. When performance becomes 'more than good enough,' modularize and open architectures. Interdependent architecture optimizes performance; modular architecture optimizes flexibility and speed.",
    "rationale": "When functionality is inadequate, proprietary interdependent architectures provide competitive advantage. When products overshoot needs, competition shifts to speed, convenience, and customization—driving modularization. IBM's interdependence gave way to Intel/Microsoft's modular dominance.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Architecture",
    "applies_when": ["signal:performance-gap"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-heuristic-005",
    "source": "The Innovator's Solution",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use emergent strategy when the future is hard to read and in early phases. Switch to deliberate strategy once a winning formula is clear. Over 90% of successful new businesses succeeded with a strategy different from what founders originally planned.",
    "rationale": "Emergent strategy bubbles up from daily decisions responding to unforeseen problems or opportunities. Deliberate strategy is top-down and analytical. Implementing deliberate strategy too early (when right strategy is unknown) or failing to switch causes failure.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["stage:early", "context:high-uncertainty"],
    "breaks_when": ["context:winning-strategy-clear"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-pattern-001",
    "source": "The Innovator's Solution",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The Law of Conservation of Attractive Profits: when modularity and commoditization cause profits to disappear at one stage, the opportunity to earn attractive profits with proprietary products usually emerges at an adjacent stage in the value chain.",
    "rationale": "Low-cost assemblers must move up-market after defeating competitors, demanding better performance from key components. Performance-defining subsystems become 'not good enough,' forcing subsystem suppliers to develop proprietary designs. Profits shift to these suppliers.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["signal:commoditization", "market:mature"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-failuremode-001",
    "source": "The Innovator's Solution",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Framing disruptive innovation as a threat to secure resources leads to failure. When visionary executives frame disruption as threat, they focus on protecting current customers and enhancing technology for mainstream—forcing it to compete on a sustaining basis.",
    "rationale": "Research by Clark Gilbert shows threats elicit stronger responses than opportunities. Frame as threat during resource allocation to secure funds, then shift to autonomous organization that frames it as opportunity to target new markets with different business model.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-technology", "signal:resource-competition"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-failuremode-002",
    "source": "The Innovator's Solution",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The ROA-maximizing death spiral: commoditized assemblers outsource activities to boost Return on Assets, inadvertently empowering suppliers who integrate forward and capture the value chain. Core competence is dangerously inward-looking—focus on where money will be.",
    "rationale": "Under commoditization pressure, companies can't increase profit, so they shrink assets by outsourcing 'noncore' activities. Each decision temporarily boosts ROA. Suppliers taking on these activities become more integrated and move up the value chain, gaining optimization opportunities.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["signal:margin-pressure", "signal:investor-pressure"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-failuremode-003",
    "source": "The Innovator's Solution",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Organizations cannot disrupt themselves if the disruptive venture is housed within the mainstream business unit. The processes and values of the existing organization will inevitably force the new business to conform to its established model.",
    "rationale": "Mainstream processes and values are designed for sustaining innovation. Disruptive ventures promising lower margins and targeting non-customers are deprioritized. Autonomy is essential—not geographical separation but freedom to create new processes and cost structures.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:disruptive-venture", "structure:integrated-org"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-failuremode-004",
    "source": "The Innovator's Solution",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Selecting managers based on 'right stuff' attributes fails for disruptive ventures. Management skills are shaped by past experiences. For disruption, managers need experience with uncertainty, market definition, building new channels, and managing expectations—not unbroken strings of successes.",
    "rationale": "Professor Morgan McCall's research shows capability depends on problems wrestled with. Pandesic (Intel/SAP joint venture) failed by selecting highly successful executives who lacked experience launching new disruptive businesses from scratch. The 'schools of experience' matter more than attributes.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["context:disruptive-venture", "stage:team-building"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "innovators-solution-example-001",
    "source": "The Innovator's Solution",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Intel's shift from DRAM to microprocessors was emergent strategy driven by resource allocation. Monthly production meetings diverted capacity from low-margin DRAMs to high-margin microprocessors based on 'gross margins per wafer start,' while senior management still invested in DRAM R&D.",
    "rationale": "Strategic shift was primarily result of daily decentralized decisions, not top-down mandate. Senior management only recognized Intel had become a microprocessor company in 1984 during financial crisis. Once strategy became clear, they took deliberate control of resource allocation.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["context:resource-allocation"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1980, "end_year": 1985 },
    "outcome": "Worked",
    "context": ["enterprise", "emergent-strategy"]
  },
  {
    "id": "innovators-solution-example-002",
    "source": "The Innovator's Solution",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Johnson & Johnson's Medical Devices and Diagnostics group grew 11% annually by acquiring disruptive businesses early (Ethicon Endo-Surgery, Cordis, Lifescan, Vistakon). Consumer Products group acquiring non-disruptive businesses grew only 4% annually.",
    "rationale": "MDD acquired early-stage disruptive companies before growth was obvious and expensive. They acquired businesses targeting emerging opportunities in endoscopic surgery, angioplasty, glucose meters, and disposable contact lenses—all disruptive to existing solutions.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["context:acquisition-strategy", "goal:growth"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1985, "end_year": 2000 },
    "outcome": "Worked",
    "context": ["enterprise", "healthcare", "acquisition"]
  },
  {
    "id": "innovators-solution-example-003",
    "source": "The Innovator's Solution",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Charles Schwab succeeded with online brokerage by creating autonomous venture with lower cost structure. Its $29.95 online trades were initially disruptive to mainstream but became the company's core, changing its corporate values. Autonomy allowed profitability at low price points.",
    "rationale": "New prioritization criteria (values) can only be created by establishing new business units with new cost structures. The mainstream organization's values would have dismissed $29.95 trades as unattractive. Autonomy enabled different economics that eventually transformed the entire company.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:self-disruption", "goal:new-market"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1995, "end_year": 2000 },
    "outcome": "Worked",
    "context": ["fintech", "disruptive-technology"]
  },
  {
    "id": "innovators-solution-example-004",
    "source": "The Innovator's Solution",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Bank One's WingspanBank.com failed because online banking was a sustaining innovation—customers already had accounts, no low-end disruption. As sustaining innovation, it should have been integrated into mainstream to leverage existing processes, not set up as costly autonomous unit.",
    "rationale": "The key error was treating a sustaining innovation like a disruptive one. Autonomous units are for disruption. Sustaining innovations should leverage existing processes and values. WingspanBank competed head-on in an already served market with no disruptive advantage.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:sustaining-innovation"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1999, "end_year": 2001 },
    "outcome": "Failed",
    "context": ["fintech", "sustaining-innovation"]
  },
  {
    "id": "innovators-solution-example-005",
    "source": "The Innovator's Solution",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Prodigy Communications failed because it used deliberate strategy too rigidly. When users unexpectedly used email more than content/shopping, Prodigy charged extra for email instead of adapting. AOL capitalized on this emergent demand and won the market.",
    "rationale": "Prodigy invested heavily based on deliberate strategy for online content and shopping. When emergent signal showed different user behavior, they tried to suppress it rather than adapt strategy. The failure to recognize and respond to emergent signals proved fatal.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:new-market", "signal:unexpected-user-behavior"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1988, "end_year": 1996 },
    "outcome": "Failed",
    "context": ["consumer-internet", "deliberate-strategy"]
  }
]

