[
  {
    "id": "lean-startup-heuristic-001",
    "source": "The Lean Startup",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "The biggest waste is building something nobody wants, even if it's on time and on budget. Validated learning—discovering what customers truly want—is the correct unit of progress for startups.",
    "rationale": "Traditional metrics like hitting deadlines or shipping features can be misleading if the startup is building something customers don't want. Startup productivity is systematically figuring out the right things to build, measured by validated learning, not features shipped.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:pre-PMF", "context:high-uncertainty"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-heuristic-002",
    "source": "The Lean Startup",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "An MVP is the version of the product that enables a full turn of the Build-Measure-Learn loop with the least effort. When in doubt about MVP features, simplify—any work beyond what's required to start learning is waste.",
    "rationale": "Unlike a prototype for design questions, an MVP tests fundamental business hypotheses about value and growth. Target early adopters who prefer an 80% solution and value being first, rather than mainstream customers who demand perfection.",
    "lens": ["Customer", "Feasibility"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:pre-PMF", "goal:hypothesis-testing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-heuristic-003",
    "source": "The Lean Startup",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Every startup must test two leap-of-faith assumptions: the value hypothesis (does the product deliver value to customers?) and the growth hypothesis (how will new customers discover the product?).",
    "rationale": "These are the riskiest elements of the business plan upon which everything depends. If false, the venture risks total failure. Testing these assumptions early is critical. Facebook validated both: high daily engagement proved value, rapid campus takeovers proved growth.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["stage:early", "context:new-venture"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-heuristic-004",
    "source": "The Lean Startup",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Startup runway is better measured by the number of pivots left, not just cash or time remaining. Getting to pivots faster extends runway.",
    "rationale": "A pivot is a structured course correction testing a new fundamental hypothesis about the product, business model, or engine of growth. Faster learning cycles mean more opportunities to find what works before resources run out.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["stage:pre-PMF", "signal:limited-runway"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-heuristic-005",
    "source": "The Lean Startup",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use cohort analysis instead of gross numbers. Gross metrics like total users can create false sense of progress even if underlying business isn't improving. Cohort metrics reveal if changes actually affect customer behavior.",
    "rationale": "IMVU's gross metrics looked great while its cohort metrics were stagnant. The cohort graph showed that despite countless product improvements, the crucial conversion rate to paying customers remained flat at around 1%, forcing deeper inquiry.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["stage:growth", "metric:user-tracking"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-failuremode-001",
    "source": "The Lean Startup",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Vanity metrics can obscure the need to pivot by creating a false sense of success. Total registered users or total revenue can look like a hockey stick while the underlying business isn't improving.",
    "rationale": "Grockit initially used vanity metrics (total customers, total questions answered) leading to a feeling of progress without actual improvement. IMVU's gross metrics looked great while its cohort metrics showed conversion remained flat despite countless product improvements.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:metrics-look-good", "signal:stagnant-growth"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-failuremode-002",
    "source": "The Lean Startup",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Arguments by analogy can obscure the true leap of faith and make a business seem less risky than it is. Saying 'our tech is like X which succeeded in market Y' hides the actual untested assumptions.",
    "rationale": "Every business plan begins with assumptions that must be tested. Using analogies to previous successes avoids identifying the specific conditions that must be true for this venture. The analogy may not hold.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:pitching", "context:strategy-planning"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-failuremode-003",
    "source": "The Lean Startup",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Companies that can't pivot based on market feedback risk getting stuck in the 'land of the living dead'—neither growing sufficiently nor dying, just consuming resources without progress.",
    "rationale": "Many startups have some traction but aren't truly growing. Optimism can mask this. Unclear hypotheses make it hard to experience clear failure, which is often the impetus for radical change. Fear of acknowledging failure delays necessary pivots.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:flat-growth", "signal:unclear-hypotheses"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-failuremode-004",
    "source": "The Lean Startup",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "If you cannot fail, you cannot learn. Simply shipping a product to 'see what happens' isn't enough—without clear hypotheses, learning is not guaranteed.",
    "rationale": "A true experiment begins with a clear hypothesis that makes testable predictions. The goal of experiments is to discover how to build a sustainable business around the startup's vision. Just doing isn't enough—you need to know what you're testing.",
    "lens": ["Business"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["signal:no-clear-hypothesis", "stage:building"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-pattern-001",
    "source": "The Lean Startup",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Three engines of growth exist: Sticky (reduce churn), Viral (viral coefficient > 1), and Paid (LTV > CPA). Startups should focus on mastering one engine at a time rather than optimizing all simultaneously.",
    "rationale": "Each engine has different key metrics and requires different product focus. Sticky engine focuses on retention; viral engine optimizes the sharing loop; paid engine increases LTV or decreases CPA. The chosen engine defines how to measure product/market fit.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["stage:growth", "goal:sustainable-growth"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-pattern-002",
    "source": "The Lean Startup",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Working in small batches is faster than large batches. Problems are discovered almost immediately, minimizing rework. Finished products are produced much sooner. This accelerates the Build-Measure-Learn loop.",
    "rationale": "Large batches create illusion of efficiency for individual specialists but cause system-level inefficiencies like interruptions, rework, and delays. The overhead of moving large batches incentivizes even larger batches, leading to 'bet the company' releases with high risk.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["goal:faster-learning", "context:product-development"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-startup-example-001",
    "source": "The Lean Startup",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Zappos tested its hypothesis that customers would buy shoes online by posting photos of shoes from local stores. If sold, founder bought at full price. This simple MVP tested demand and revealed unexpected customer behaviors.",
    "rationale": "Nick Swinmurn didn't build inventory or logistics—he tested the core assumption first. The experiment allowed interaction with real customers (payments, returns, support) and provided more accurate data than surveys or market research.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:pre-PMF", "goal:validate-demand"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1999, "end_year": 1999 },
    "outcome": "Worked",
    "context": ["e-commerce", "pre-PMF"]
  },
  {
    "id": "lean-startup-example-002",
    "source": "The Lean Startup",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Groupon's MVP was a WordPress blog skinned to say 'Groupon.' Deals were posted daily, T-shirts sold via email requests for size/color, coupons manually generated and emailed as PDFs. This was enough to prove the concept.",
    "rationale": "The MVP didn't require building sophisticated technology. It focused on testing whether customers would buy daily deals and whether the business model worked, before investing in automation and scale.",
    "lens": ["Business"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:pre-PMF", "goal:validate-model"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2008, "end_year": 2008 },
    "outcome": "Worked",
    "context": ["marketplace", "pre-PMF"]
  },
  {
    "id": "lean-startup-example-003",
    "source": "The Lean Startup",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "IMVU spent six months building IM interoperability, then launched to crickets. Customers didn't want an add-on—they wanted a standalone network to meet new people. Much engineering work was thrown away.",
    "rationale": "The team's initial strategy was built on flawed assumptions about what customers wanted. The question arose: could this learning have happened faster and with less effort? Testing with only one IM network, or offering a download before building anything, would have revealed the flaw sooner.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["signal:untested-assumptions", "stage:early"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2004, "end_year": 2005 },
    "outcome": "Failed",
    "context": ["social", "pre-PMF"]
  },
  {
    "id": "lean-startup-example-004",
    "source": "The Lean Startup",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Votizen's MVP cycles accelerated from 8 months to 4 to 3 to 1 month through four pivots—from social network to social lobbying to B2B to self-serve platform—due to accumulated learning, not just reusable code.",
    "rationale": "Each pivot tested a new fundamental hypothesis. Innovation accounting provided data for informed pivot decisions. The final platform pivot achieved strong metrics including 11% paying users, creating a viable viral growth model.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["stage:pre-PMF", "signal:poor-metrics"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2009, "end_year": 2012 },
    "outcome": "Worked",
    "context": ["civic-tech", "multiple-pivots"]
  },
  {
    "id": "lean-startup-example-005",
    "source": "The Lean Startup",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Dropbox validated demand with a simple video demonstrating intended functionality, targeted at tech early adopters with in-jokes. It drove hundreds of thousands to their beta waiting list without building the actual product.",
    "rationale": "Drew Houston couldn't demonstrate the product's value with a simple prototype because syncing worked invisibly. The video MVP tested the assumption that people wanted seamless file-sync, proving demand before solving hard technical problems.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["product:hard-to-demo", "stage:pre-build"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2007, "end_year": 2007 },
    "outcome": "Worked",
    "context": ["consumer-tech", "pre-PMF"]
  }
]

