[
  {
    "id": "lean-product-playbook-heuristic-001",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use the Importance versus Satisfaction framework: high importance and low satisfaction indicate underserved needs—significant opportunities. Focus on needs customers care about deeply but existing solutions address poorly.",
    "rationale": "Customer value creation requires focusing on the High Importance/Low Satisfaction quadrant. Uber addressed high-importance transportation needs with low satisfaction with traditional taxis by offering superior convenience, safety, and transparency.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["stage:opportunity-identification", "goal:find-underserved-needs"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-002",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Distinguish problem space from solution space. Problems define markets, not existing solutions. Thinking in problem space allows for a wider range of potentially better solutions than jumping straight to product ideas.",
    "rationale": "Scott Cook viewed pen and paper as TurboTax's biggest competitor—markets are defined by needs (preparing taxes), not existing products (tax software). The space pen versus pencil story illustrates the danger of jumping to solutions without understanding problems.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["stage:early-ideation", "context:new-product"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-003",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Classify needs using the Kano model: must-haves don't create satisfaction when met but cause dissatisfaction when absent; performance needs scale proportionally; delighters create unexpected satisfaction. Needs migrate over time from delighters to must-haves.",
    "rationale": "Must-haves are table stakes. Performance needs follow 'more is better.' Delighters add unexpected value but don't cause dissatisfaction when absent. As customer expectations rise, yesterday's delighters become today's must-haves.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:feature-prioritization"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-004",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "For new products, optimize metrics in this order: retention first, then conversion, then acquisition. Retention is most closely tied to product-market fit. Optimizing acquisition before retention wastes resources on a leaky bucket.",
    "rationale": "High retention indicates customers find value and continue using the product. Optimizing conversion ensures a higher percentage of prospects become customers. Expanding acquisition efforts once retention and conversion are strong maximizes return.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["stage:post-launch", "goal:growth"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-005",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Sean Ellis' product-market fit question: Ask users how disappointed they would be if they could no longer use the product. If 40%+ say 'very disappointed,' you have product-market fit.",
    "rationale": "This attitudinal metric serves as a proxy for product-market fit from surveys. It indicates whether customers find genuine value in the product versus mild utility or indifference. Below 40% suggests the product hasn't achieved sufficient customer value.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Quality",
    "applies_when": ["stage:post-MVP", "goal:validate-PMF"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-006",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Prioritize features using ROI: customer value divided by development effort. Focus on features with highest ROI. When ROIs are similar, prioritize smaller features to deliver value sooner.",
    "rationale": "Return is estimated customer value; Investment is time and resources to build. Features with highest ROI maximize impact per unit of effort. Smaller scope first reduces uncertainty and enables faster feedback cycles.",
    "lens": ["Business", "Feasibility"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:MVP-definition", "constraint:limited-resources"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-heuristic-007",
    "source": "The Lean Product Playbook",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Test before you build. Showing customers design artifacts or prototypes elicits feedback that reveals underlying needs. Testing mockups saves time and money compared to building coded products first.",
    "rationale": "Wireframes, mockups, and prototypes provide tangible items for customers to react to. Customer feedback on solutions helps teams infer and validate problem space hypotheses. Validating concepts with customers provides confidence before development investment.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Sequencing",
    "applies_when": ["stage:pre-build", "goal:risk-reduction"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-failuremode-001",
    "source": "The Lean Product Playbook",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Inside-out development—where product ideas originate internally without sufficient customer validation—often leads to products nobody wants. Start with deeply understanding customer problems before designing solutions.",
    "rationale": "Inside-out development is driven by internal assumptions and ideas rather than real customer needs. Steve Blank's advice to 'get out of the building' addresses this risk. Outside-in development begins with understanding customer needs through research.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "*",
    "applies_when": ["signal:no-customer-contact", "stage:early"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-failuremode-002",
    "source": "The Lean Product Playbook",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "A/B testing is not a substitute for qualitative research and solid problem space understanding. Skipping qualitative research can lead to optimizing for a local maximum while building on flawed foundational hypotheses.",
    "rationale": "A/B testing is powerful but only measures impact of changes, not why. Problem space understanding is less amenable to A/B testing and requires qualitative methods. Changing fundamental assumptions after building is costly and difficult.",
    "lens": ["Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:relying-only-on-AB-tests", "stage:optimization"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-failuremode-003",
    "source": "The Lean Product Playbook",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Value propositions that don't anticipate future market trends risk becoming irrelevant. Strategic value propositions must consider how your and competitors' value propositions might change over time.",
    "rationale": "The Flip video camera was initially successful but failed to anticipate the rise of smartphones with built-in video recording. Don't just design for the current market; consider how it will evolve. Predict what competitors are likely to do.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["market:technology-convergence", "signal:hardware-product"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-pattern-001",
    "source": "The Lean Product Playbook",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The Product-Market Fit Pyramid: five layers from bottom to top—target customers, underserved needs, value proposition, feature set, and UX. Each layer builds on the one below. The bottom two layers define the market; the top three define the product.",
    "rationale": "A hierarchical model breaking down product-market fit. Target customers and underserved needs represent the problem space (market). Value proposition, feature set, and UX represent the solution space (product). Building proceeds bottom-up through the pyramid.",
    "lens": ["Customer", "Business"],
    "level": "Product",
    "dimension": "*",
    "applies_when": ["goal:achieve-PMF"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-pattern-002",
    "source": "The Lean Product Playbook",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The UX Design Iceberg has four layers: conceptual design (core mental model), information architecture (structure and navigation), interaction design (user flows and system responses), and visual design (aesthetics). Most critical work is 'below the surface.'",
    "rationale": "Effective UX design progresses from foundational conceptual design to visible visual design. A strong conceptual design makes the product feel intuitive by aligning with how users already think. Information architecture ensures users can easily find what they need.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Experience",
    "applies_when": ["stage:design", "goal:usability"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-pattern-003",
    "source": "The Lean Product Playbook",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Olsen's Law of Usability: The more user effort required, the lower the percentage of users who will take that action. Each additional step or cognitive load reduces completion rates.",
    "rationale": "Ease of use allows users to focus on accomplishing their goals rather than fighting the interface. Usability is measured by task completion rates, time to complete, and perceived effort. Reducing friction directly improves conversion through user flows.",
    "lens": ["Customer"],
    "level": "Feature",
    "dimension": "Friction",
    "applies_when": ["goal:improve-conversion", "goal:usability"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "lean-product-playbook-example-001",
    "source": "The Lean Product Playbook",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Quicken became #1 despite being the 47th personal finance product by focusing on underserved needs and superior UX. Intuit's checkbook-based design resonated with customers, pioneering usability testing and iterative development.",
    "rationale": "Existing personal finance products were difficult to use. Intuit's founders conducted 'follow me home' sessions to understand real needs. The intuitive checkbook design and early adoption of usability testing demonstrated strong product-market fit in a crowded market.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Experience",
    "applies_when": ["market:crowded-category"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 1983, "end_year": 1990 },
    "outcome": "Worked",
    "context": ["consumer-software", "crowded-market"]
  },
  {
    "id": "lean-product-playbook-example-002",
    "source": "The Lean Product Playbook",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "The Flip video camera failed despite initial success because it didn't anticipate smartphones with built-in video recording. Not predicting market shifts driven by technological convergence led to obsolescence.",
    "rationale": "Strategic value propositions must anticipate future market trends and competitive moves. The Flip was successful in a standalone category but failed to consider how smartphone cameras would eliminate the need for dedicated simple video cameras.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["market:technology-convergence"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2006, "end_year": 2011 },
    "outcome": "Failed",
    "context": ["consumer-hardware", "technology-convergence"]
  }
]

