[
  {
    "id": "ltv-heuristic-001",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "LTV (Customer Lifetime Value) represents the total net profit a customer brings over their entire relationship with the company, not just gross revenue. This metric moves beyond individual transactions, offering a holistic view of customer profitability over time.",
    "rationale": "Acquiring new customers is often significantly more expensive than retaining existing ones. By focusing on LTV, companies can make more informed decisions about marketing spend, customer service investments, product development, and retention strategies.",
    "lens": ["Business", "Customer"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["customer-value:measuring", "investment:deciding"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-heuristic-002",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "The LTV:CAC ratio is a fundamental indicator of business health and scalability. A healthy ratio is generally 3:1 or higher, meaning for every dollar spent on acquisition, the business generates at least three dollars in lifetime value. Below 1:1 indicates an unsustainable business model.",
    "rationale": "Without this ratio, businesses cannot accurately determine their return on marketing investment. They might continue pouring money into acquisition channels that bring in customers who cost more to acquire than they ever contribute in net profit.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["growth:evaluating", "marketing:budgeting"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-heuristic-003",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Customer retention is a primary driver of LTV. A higher retention rate directly translates to a longer average customer lifespan, which is a critical variable in the LTV calculation. Even small improvements in retention can yield large LTV gains.",
    "rationale": "The longer a customer stays, the more purchases they make, and the more revenue and profit they contribute. Improving retention is one of the most effective ways to increase overall LTV.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["retention:prioritizing", "churn:reducing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-heuristic-004",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Customer segmentation is critical for accurate LTV insights. A single average LTV for the entire customer base masks significant variations in value and behavior. A small percentage of customers often contribute disproportionately large share of revenue (Pareto principle).",
    "rationale": "Treating all customers as equally valuable leads to generic strategies that fail to maximize potential of high-value customers or effectively address needs of at-risk segments. High-LTV 'whale' customers deserve premium attention and tailored retention.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["segmentation:planning", "marketing:targeting"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-heuristic-005",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "LTV is fundamentally about predictive analytics. While historical data informs the calculation, the true power of LTV lies in its ability to forecast future revenue streams, enabling proactive management of customer relationships.",
    "rationale": "This predictive capability allows businesses to identify at-risk customers before they churn and invest in high-value customers to encourage further engagement. If a business predicts high LTV for a segment, it can justify higher CAC for that segment.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["forecasting:revenue", "intervention:proactive"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-heuristic-006",
    "source": "LTV Guide",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Pricing and packaging is a powerful growth lever. Strategic pricing and effective upselling/cross-selling directly increase the Monetary Value component of LTV. Successful cross-selling increases total basket size and creates a stickier customer relationship.",
    "rationale": "By understanding customer segments and their LTV potential, businesses can tailor revenue-generating offers to maximize profitability without alienating customers. Upselling the right customers to premium tiers significantly increases LTV.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["pricing:optimizing", "upselling:designing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-failuremode-001",
    "source": "LTV Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Neglecting to factor Customer Acquisition Cost (CAC) into LTV calculation is a critical mistake. Calculating LTV as just gross revenue ignores substantial expenses to acquire and support customers throughout their lifecycle, leading to overestimated profitability and poor investment decisions.",
    "rationale": "A true LTV calculation must subtract these costs to arrive at net profit contribution. Without accounting for costs, businesses can overspend on acquisition or underinvest in retention, leading to unsustainable business models.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["ltv:calculating", "profitability:assessing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-failuremode-002",
    "source": "LTV Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Assuming a single average LTV for all customers is a common and detrimental mistake. This masks significant variations in value and behavior. Businesses might overinvest in low-value, high-maintenance customers while neglecting high-value 'whales' who deserve premium attention.",
    "rationale": "If high average LTV is driven by small segment of extremely valuable customers, and majority have much lower LTV, you could be overspending to acquire the majority of your customer base. Apply a single average can lead to misguided marketing efforts.",
    "lens": ["Business", "Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["ltv:calculating", "segmentation:missing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-failuremode-003",
    "source": "LTV Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Focusing solely on gross revenue rather than net profitability when calculating LTV leads to inflated figures and misunderstanding of customer's true worth. Without subtracting ongoing costs to serve (COGS, support, delivery), the LTV figure is just a revenue projection, not a measure of financial health.",
    "rationale": "Businesses might acquire or retain customers who, despite generating significant revenue, are actually a drain on resources due to high service costs or low margins. This leads to 'leaky bucket' syndrome—growing revenue but shrinking margins.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["ltv:calculating", "costs:ignoring"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-failuremode-004",
    "source": "LTV Guide",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Calculating LTV once and treating it as static is a significant mistake. Customer behavior, market conditions, product offerings, and pricing strategies constantly evolve. An LTV model built on outdated data will quickly become inaccurate and lead to flawed decisions.",
    "rationale": "LTV is a dynamic metric requiring continuous monitoring and recalibration. Customer churn rates change, average purchase values fluctuate, marketing channel effectiveness shifts. Must establish regular cadence for updating models.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["ltv:maintaining", "models:outdated"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-pattern-001",
    "source": "LTV Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Simple LTV formula: (Average Purchase Value × Average Purchase Frequency × Average Customer Lifespan) – Customer Acquisition Cost. For subscription: (ARPU × Average Subscription Duration × Gross Margin) – CAC.",
    "rationale": "This provides a baseline understanding of customer value. Easy to compute and transparent, relying on readily available transactional data. Good starting point for businesses new to LTV analysis.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["ltv:calculating", "baseline:establishing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-pattern-002",
    "source": "LTV Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "AARRR (Pirate Metrics) framework for LTV optimization: Acquisition (attract right customers), Activation (get to 'aha moment'), Retention (keep engaged, prevent churn), Revenue (maximize monetary value through pricing/upsells), Referral (leverage customers for organic growth).",
    "rationale": "Each stage directly impacts different components of LTV. Optimizing each stage systematically increases customer lifetime value and drives sustainable growth. Provides comprehensive framework for where to intervene.",
    "lens": ["Business", "Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["ltv:optimizing", "funnel:analyzing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-pattern-003",
    "source": "LTV Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "RFM (Recency, Frequency, Monetary Value) analysis for customer segmentation: Categorize customers based on how recently they purchased, how often they purchase, and how much they spend. Customers high on all three are highest LTV; low on all three are at risk.",
    "rationale": "Powerful yet simple segmentation that immediately informs targeted campaigns. Helps identify 'whale' customers who contribute disproportionately to revenue and at-risk customers requiring intervention.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["segmentation:implementing", "targeting:prioritizing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-pattern-004",
    "source": "LTV Guide",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Cohort analysis for predictive LTV: Group customers by acquisition date, track cumulative revenue per customer over successive periods, observe decay rate and revenue growth for older cohorts, project future LTV of newer cohorts based on trajectory.",
    "rationale": "Provides forward-looking insights and helps evaluate effectiveness of marketing campaigns or product changes. If new cohort shows higher LTV trajectory than previous, indicates campaign success. Powerful for subscription/recurring revenue models.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["ltv:predicting", "cohorts:analyzing"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-signal-001",
    "source": "LTV Guide",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Key LTV component metrics: Average Purchase Value (APV), Average Purchase Frequency (APF), Customer Lifespan/Average Customer Lifespan (CL/ACL), Gross Margin Per Customer, Customer Acquisition Cost (CAC), Churn Rate, Customer Retention Rate.",
    "rationale": "These metrics provide a holistic view of customer behavior and profitability. If LTV is declining, diagnose whether customers are spending less per purchase, buying less often, or churning faster to target interventions.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["ltv:diagnosing", "metrics:tracking"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-example-001",
    "source": "LTV Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon Prime LTV strategy: Annual fee creates commitment, making customers more likely to consolidate shopping on Amazon to maximize value. Prime members spend significantly more than non-members. Bundling free shipping, streaming, exclusive deals increases purchase frequency and retention.",
    "rationale": "The upfront fee acts as switching cost. Personalized recommendations increase AOV and purchase frequency. Expansion into AWS, Kindle, Alexa, Whole Foods locks customers into ecosystem, increasing overall LTV across multiple touchpoints.",
    "lens": ["Business", "Customer"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["ecommerce", "subscription", "ecosystem"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-example-002",
    "source": "LTV Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Netflix retention-focused LTV strategy: Entire business model hinges on keeping subscribers engaged and preventing churn. Massive investment in original content creates compelling reasons to stay—exclusive viewing experiences not available elsewhere. Personalized recommendation engine helps users discover new shows, increasing engagement and perceived value.",
    "rationale": "Long-term subscriber far more valuable than short-term one. Seamless UX across devices reduces friction. Tiered pricing allows choice fitting needs. Quick customer service resolution. Continuous content release ensures always something fresh.",
    "lens": ["Business", "Customer"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["streaming", "subscription", "content"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "ltv-example-003",
    "source": "LTV Guide",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Starbucks Rewards LTV strategy: Gamified loyalty program where members earn 'Stars' for purchases redeemable for free items—increases purchase frequency. Mobile app tracks individual purchase history enabling highly targeted personalized offers. Mobile ordering reduces friction for repeat purchases.",
    "rationale": "Transforms casual coffee drinkers into loyal, high-value customers. Even in high-frequency, low-margin business, cumulative value of loyal customer making multiple purchases over years far outweighs profit from single transaction. Convenience contributes to long-term loyalty.",
    "lens": ["Business", "Customer"],
    "level": "Operating",
    "dimension": "Process",
    "outcome": "Worked",
    "context": ["retail", "loyalty", "personalization"],
    "strength": "High",
    "evidence_grade": "Secondary"
  }
]

