[
  {
    "id": "the-product-book-heuristic-001",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Product managers act as customer representatives within a company. Their ultimate goal is ensuring products enable customers to be 'awesome' by addressing real problems, not just delivering features.",
    "rationale": "PMs are the voice of the customer, lack direct authority over others, and rely on communication and trust. A significant part of the job is saying 'no' to ideas that don't align with customer needs or strategic goals.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "*",
    "applies_when": ["role:product-manager"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-002",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Understanding a company's 'why'—its core purpose and differentiating value—is the most fundamental strategic element. Products are merely tools used to fulfil this purpose; customers buy into the 'why.'",
    "rationale": "Revenue is a result of doing the right thing for customers, not the primary reason for existing. Successful companies start by addressing customer problems, not seeking uses for technology. A consistent 'why' guides product expansion.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:strategic-planning", "stage:early"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-003",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Personas should focus on 'Jobs to Be Done'—what customers are trying to accomplish—rather than demographics alone. This provides more effective segmentation for product decisions.",
    "rationale": "Real customers have diverse traits. Personas abstract common characteristics and help PMs step into customer shoes. They should reflect real behaviours and be refined as more is learned about customers.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["context:persona-development"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-failuremode-001",
    "source": "The Product Book",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Initial product ideas are hypotheses, not facts. A significant percentage fail to achieve intended goals. PMs must accept that personal opinions about customer needs may be incorrect.",
    "rationale": "Successful products address actual customer needs, not just what individuals desire. The goal is transforming opinions into validated facts through research and experimentation. Validating before investing resources is crucial.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "*",
    "applies_when": ["stage:ideation", "signal:untested-assumption"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-004",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Differentiate vanity metrics that sound good from actionable metrics that provide insights for decision-making. Success metrics should directly tie to short-term product goals and long-term company strategy.",
    "rationale": "Metrics track product usage and business outcomes. They validate whether strategy and changes are effective. The engagement hierarchy (engagement, retention, self-perpetuating) provides a framework for consumer startup metrics.",
    "lens": ["Business"],
    "level": "Product",
    "dimension": "Quality",
    "applies_when": ["context:metrics-definition"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-005",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use the Kano Model to classify customer needs into basic (expected), performance (more is better), and excitement (delighters). This uncovers unaddressed needs and assesses potential impact of new features.",
    "rationale": "Basic needs cause dissatisfaction if missing but no delight if present. Performance needs scale linearly with satisfaction. Excitement features create disproportionate delight but aren't expected. Helps prioritise feature development.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["context:feature-prioritisation"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-006",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "In customer interviews, ask about past and current behaviours rather than hypothetical future actions. Probe with 'why' questions and request specific examples to uncover underlying motivations.",
    "rationale": "Asking about hypothetical futures invites the 'ideal self' bias—people describe what they wish they'd do, not reality. Leading questions influence responses. The 'magic wand' question can elicit information about biggest pain points.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Experience",
    "applies_when": ["context:customer-research", "method:interviews"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-pattern-001",
    "source": "The Product Book",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Four MVP types test different hypotheses: Preorder (interest via fake landing page), Concierge (manual task performance), Wizard of Oz (appears automated but humans behind scenes), Fake Door (UI element for unbuilt feature).",
    "rationale": "Experiments should be quick, cheap, and disposable once learning is achieved. Each MVP type tests a specific assumption—market demand, process steps, automation feasibility, or feature interest—before full development investment.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:validation", "constraint:resource-limited"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-failuremode-002",
    "source": "The Product Book",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Even validated ideas fail to achieve product/market fit due to: missing basic expected features, taking too long to build (changing needs), feature overload (complexity), or unclear value proposition.",
    "rationale": "Products evolve over time and initial versions are rarely perfect. The PM must anticipate these failure modes and mitigate them through careful scope definition, clear messaging, and iterative development.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:development", "signal:scope-creep"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-007",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Define MVP by identifying the single most important aspect delivering real value. MVPs should feel minimally featured to the PM but functional enough for customers—well-designed, engineered, and tested.",
    "rationale": "Reduced friction from essential-only features minimises complexity. MVPs fuel iteration through quick release and feedback. The PM should feel uncomfortable with how minimal the scope is, but customers should find it valuable.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:planning", "goal:validation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-008",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "PRDs (Product Requirements Documents) should include 'Features Out'—explicitly listing what won't be included and why. This prevents scope creep and ensures alignment on boundaries.",
    "rationale": "PRDs serve as central communication tools aligning stakeholders. They should be living documents updated throughout development. Explicit exclusions are as important as inclusions for maintaining focus and managing expectations.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["context:requirements-documentation"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-009",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "PMs should define problems, not dictate solutions. Provide clear personas, requirements, and goals in the PRD; use 'napkin sketches' to convey ideas without implying final design solutions.",
    "rationale": "Designers and engineers are experts in finding solutions. Avoiding micromanagement and trusting expertise leads to better outcomes. Collaborative ideation works better than top-down specification.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:cross-functional-collaboration"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-failuremode-003",
    "source": "The Product Book",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Avoid saying 'Can't you just...' to engineers. This phrase implies tasks are simple and undermines expertise. Phrase requests carefully and view interactions as opportunities to learn from engineers.",
    "rationale": "Coding is complex. Engineers are motivated by challenging problems and learning. Ensuring they feel respected, recognised, and confident in product direction is essential for productive collaboration and high-quality output.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:engineering-collaboration"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-heuristic-010",
    "source": "The Product Book",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Product messaging should focus on customer outcomes—what the product lets customers do to make their life better—not just what the product is. Frame messaging as a story to make it engaging.",
    "rationale": "Use language that resonates with customers and reflects how they see the world. Messaging should address the 'why', fresh aspects, benefits, differentiation, and intended first impression. Tailor for different personas and channels.",
    "lens": ["Customer"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:go-to-market", "stage:launch"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-product-book-pattern-002",
    "source": "The Product Book",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The product-development life cycle has five stages: finding/planning the opportunity, designing the solution, building the solution, sharing the solution (launch), and assessing the solution. It's iterative, not linear.",
    "rationale": "The recommendation from assessment feeds back into finding the next opportunity. Modern methodologies favour iteration over waterfall. MVP concepts enable quick validation and learning within each cycle.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:product-process-design"],
    "strength": "High",
    "evidence_grade": "Secondary"
  }
]

