[
  {
    "id": "product-management-practice-heuristic-001",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Product management is a connective role, not a hybrid role. Success comes from bridging gaps and facilitating alignment across functions, not from being a jack-of-all-trades or wielding authority.",
    "rationale": "The UX/Tech/Business Venn diagram describes what a PM interacts with, not how they act. The PM's value is 'manifest in the work of their team.' Influence and trust must be earned daily within a role of irresolvable ambiguity.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:cross-functional-teams", "role:product-manager"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-002",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Prioritize 'clarity over comfort.' Actively address inconsistencies and potential misunderstandings even when uncomfortable, because silence can be misinterpreted as agreement with catastrophic consequences.",
    "rationale": "The potential downside of undercommunicating is 'cavernous and terrifying' while overcommunicating is at worst 'a few eye-rolls.' Things that seem obvious are often the source of disastrous miscommunication because nobody wants to explicitly address them.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:stakeholder-alignment", "signal:ambiguity"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-003",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Don't implement best practices without understanding your organization's specific goals first. Blindly copying what worked at Company X leads to poorly understood, resisted, and failed changes.",
    "rationale": "Past successes were likely due to specific organizational contexts involving trial and error. Most published case studies are 'largely recruiting propaganda.' The unspoken question 'How does Facebook do PM?' often means 'we want to do exactly the same thing.'",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:process-change", "signal:external-framework-adoption"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-004",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Structure and facilitate ideas for the roadmap—don't own them. Provide templates that tie ideas to user needs and business goals. This filters half-baked ideas and creates built-in evangelists.",
    "rationale": "Every organization has plenty of ideas. The PM's job is to establish criteria to consistently evaluate ideas against goals. Attempting to be the 'true keeper of product vision' leads to a 'great big mess' when product interdependencies arise.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["context:roadmap-planning", "goal:alignment"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-failuremode-001",
    "source": "Product Management in Practice",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Blaming senior leadership to your team ('Can you believe how those idiots are jerking us around?') ruins the team by making requests seem arbitrary and positioning PM as protector rather than connector.",
    "rationale": "This creates a 'sticking it to the man' mentality, fostering insulation rather than alignment. In the long term, it sets the team up for failure. PMs must manage up for clarity and take ownership of decisions when communicating to the team.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:executive-pressure", "context:team-communication"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-failuremode-002",
    "source": "Product Management in Practice",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The Hero Product Manager believes they alone can save the company and blames external factors for failures. The Product Martyr overworks publicly while covertly resenting the burden. Both create toxic team dynamics.",
    "rationale": "These archetypes are driven by insecurity. Product Martyrdom leads to viewing external requests as unreasonable impositions and measuring success by effort and ownership rather than impact. Both lead to tantrums, withholding information, and resentment.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:pm-burnout", "signal:team-tension"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-failuremode-003",
    "source": "Product Management in Practice",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Protecting the team from business goals leads to building user-centric products that miss key business metrics. Insulating rather than surfacing underlying conflicts results in defensive rethinking and low morale.",
    "rationale": "Shaun R. built a Black Friday sales page focused on users but missed business metrics. He realized he had 'insulated the team rather than trying to surface the underlying conflict.' PMs must connect user needs to business goals explicitly.",
    "lens": ["Business", "Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["context:feature-planning", "signal:user-business-tension"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-005",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Nothing you tell a senior stakeholder in a 'big' meeting should ever be a surprise. Walk stakeholders individually through new ideas before group settings to ensure they are invested.",
    "rationale": "Presenting a 'creative' new idea without getting buy-in beforehand leads to a 'bloodbath' in the meeting, demonstrating betrayal of trust. Incremental buy-in increases odds that your idea 'wins' regardless of which stakeholder 'wins.'",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:executive-meetings", "goal:proposal-approval"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-006",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Don't use the word 'data.' Describe the specific information being discussed. This invites meaningful conversations about what was gathered, how, and how it's interpreted—distinguishing information from assumption.",
    "rationale": "'Data' wields authority without specificity. All data-driven decisions involve assumptions. The most meaningful step is being completely upfront about assumptions, even presenting data that contradicts decisions. This aligns with 'clarity over comfort.'",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:decision-making", "signal:data-dependency"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-007",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Ask about specific instances, not generalizations. 'Walk me through the last meal you ate' yields more candid responses than 'What do you usually eat for lunch?' People are more honest about specific experiences.",
    "rationale": "Users are more candid about specific experiences than general preferences, especially with value-laden topics. Generalizations invite constructed, socially acceptable answers rather than authentic behavioral insights.",
    "lens": ["Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:user-research", "goal:behavioral-insight"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-failuremode-004",
    "source": "Product Management in Practice",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Don't ask users to do your job for you. Users describe solutions for reasons they can't articulate. Understanding and articulating user needs—including ones users are unaware of—is the PM's job.",
    "rationale": "The OXO measuring cup story shows users asked for 'sturdy handles' but observation revealed need for 'read from above' markings. Users are unaware of organizational intricacies or their own unmet needs. Listening only to 'power users' led Jonathan Bertfield's startup to fail.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Experience",
    "applies_when": ["context:user-research", "signal:solution-requests"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-008",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Prioritization difficulty is determined by goal clarity. The most important work happens before the formal prioritization meeting—by defining goals. Test-drive goals by trying to prioritize ideas against them with senior leaders.",
    "rationale": "A vague mission statement makes prioritization impossible. But clear OKR-style goals make prioritization straightforward, even if some stakeholders are initially 'annoyed.' Decisions are only as good as the goals that guided them.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["context:roadmap-planning", "signal:competing-priorities"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-009",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "'Change the rules, don't break the rules.' If organizational processes aren't serving goals, collaboratively evolve them rather than making ad-hoc exceptions. Breaking rules leads to dependency; changing rules scales.",
    "rationale": "Product managers who lack organization become bottlenecks with teams dependent on constant intervention. Effective organizers create systems where team members know what to work on and why without asking the PM. They ask 'how can I make sure this doesn't happen again?'",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:process-friction", "goal:scaling"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-pattern-001",
    "source": "Product Management in Practice",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Use 'disagree and commit' to achieve commitment over consensus. Interpret silence as disagreement and ask for affirmative commitment. This encourages dissenting opinions because nobody wants to be accountable for a known-to-fail plan.",
    "rationale": "Pioneered by Intel. Consensus often means unspoken disagreement, decisions avoided, or agreement born of fatigue. Commitment means explicit responsibility for a decision even if initially disagreed with. Forces critical concerns to surface before execution.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:team-decisions", "signal:false-consensus"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "product-management-practice-heuristic-010",
    "source": "Product Management in Practice",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "'Up and to the right' is a signal, not a strategy. If you don't understand why numbers are going well, you can't build on momentum or react if trends reverse. Supplement quantitative with qualitative data.",
    "rationale": "Positive trends require deeper understanding through qualitative research like talking to new users. Without understanding the 'why,' even 'important' metrics can become vanity metrics. Knowledge of causation enables strategic action.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:positive-metrics", "goal:sustainable-growth"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

