[
  {
    "id": "7-powers-heuristic-001",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Power is the set of conditions creating potential for persistent differential returns. Without Power, even operational excellence leads to commoditisation as competitive arbitrage erodes margins.",
    "rationale": "Most business value comes from out-years, so persistence is key. Each Power type has a Benefit (enhanced cash flow) and a Barrier (what prevents competitive arbitrage). Strategy is a route to continuing Power in significant markets.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:competitive-strategy"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-002",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Scale Economies create Power when per-unit costs decline as production volume increases, making it unprofitable for smaller competitors to gain market share through price competition.",
    "rationale": "The barrier is prohibitive costs of share gains. A smaller firm offering lower prices to gain scale would face losses the leader can match. Netflix's shift to original content converted variable costs to fixed, creating Scale Economies.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["cost-structure:high-fixed-costs", "market:established"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-003",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Network Economies exist when customer value increases as installed base grows. The barrier is that followers face such a value deficit that price discounts needed to attract users become 'unthinkable.'",
    "rationale": "Creates winner-take-all dynamics once leadership is achieved. Boundedness matters—network effects are constrained by the network's character (personal vs professional). Early product appeal determines rapid scaling outcomes.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["product:network-dependent", "market:early"],
    "breaks_when": ["network:bounded-differently"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-004",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Counter-Positioning applies when a newcomer adopts a superior business model that incumbents don't mimic due to anticipated damage to their existing business. The barrier is collateral damage to incumbent profits.",
    "rationale": "Incumbents rationally choose not to cannibalise high-margin existing business for lower-margin new model. Three causes: Milking (negative combined NPV), History's Slave (cognitive bias), Job Security (agency issues). Relative to incumbent only.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["context:incumbent-challenge", "model:heterodox"],
    "breaks_when": ["model:not-superior-standalone"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-failuremode-001",
    "source": "7 Powers",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Not all incumbent failures are Counter-Positioning. If the new approach is 'stand-alone unattractive' (doesn't offer attractive returns), the incumbent's inaction isn't strategic—it's simply a bad business they lack Power in.",
    "rationale": "Kodak's failure in digital wasn't Counter-Positioning because digital imaging wasn't attractive for them—their film strengths didn't transfer. This is Schumpeter's 'gales of destruction,' not strategic misstep.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["signal:technology-shift", "context:incumbent-decline"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-005",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Switching Costs create Power when customers face value loss from switching to alternatives. The benefit is higher prices for follow-on purchases; the barrier is competitors must compensate customers for switching burden.",
    "rationale": "Three types: Financial (new licenses), Procedural (retraining, integration risk), Relational (emotional bonds). Power applies only to current customers for additional purchases. HP's $160M SAP migration loss illustrates the magnitude.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["product:high-integration", "customer:enterprise"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-006",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Branding creates Power through durable attribution of higher value to objectively identical offerings, arising from historical information about the seller. The barrier is hysteresis—brands can only be created over lengthy periods.",
    "rationale": "Two benefits: Affective valence (positive emotional associations) and uncertainty reduction (peace of mind). Copycats face daunting uncertainty and high investment runways with no assurance of achieving significant affective valence.",
    "lens": ["Customer", "Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["product:consumer", "category:identity-linked"],
    "breaks_when": ["product:B2B-commodity"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-007",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Cornered Resource creates Power through preferential access at attractive terms to a coveted asset that independently enhances value. The barrier is fiat—secured by decree (legal or personal).",
    "rationale": "Five tests: Idiosyncratic (ability to acquire repeatedly), Non-arbitraged (price doesn't capture full value), Transferable (creates value elsewhere), Ongoing (explains continued returns), Sufficient (alone explains advantage).",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["asset:unique-talent", "asset:patent", "asset:rights"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-008",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Process Power creates Power through embedded organisation and activity sets enabling lower costs or superior product, matchable only by extended commitment. The barrier is hysteresis from complexity and opacity.",
    "rationale": "This is rare—most operational excellence is readily mimicked. Process Power is 'operational excellence plus hysteresis.' Toyota's TPS couldn't be replicated by GM despite full transparency because the deeper system wasn't transferable.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["operations:complex-chain", "context:decades-of-evolution"],
    "strength": "Low",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-pattern-001",
    "source": "7 Powers",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The Power Progression: Different Power types have distinct establishment windows. Origination stage: Cornered Resource, Counter-Positioning. Takeoff stage: Scale, Network, Switching Costs. Stability stage: Process Power, Branding.",
    "rationale": "Missing these windows means forfeiting certain Power types forever. Takeoff (30-40% annual growth) allows differential customer acquisition at favourable terms. In stability, share gains become too costly due to entrenched competition.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:growth-stage-assessment"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-heuristic-009",
    "source": "7 Powers",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "All Power starts with invention—of products, processes, business models, or brands. 'Me too won't do.' Invention opens the door for Power and propels market size, creating a one-two value punch.",
    "rationale": "Three paths to compelling value: Capabilities-Led (translate existing capability to unknown need), Customer-Led (known need, unknown solution), Competitor-Led (must produce step-change better product). Each has different uncertainty profiles.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["stage:early", "goal:power-creation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-failuremode-002",
    "source": "7 Powers",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Companies with strong financials during takeoff but no established Power will see gains dissipate once growth slows and competitive arbitrage catches up. Early market share from aggressive pricing proves fleeting.",
    "rationale": "The 7 Powers framework identifies desirable destinations, informing which journeys are worth taking. If Scale, Network, or Switching Cost Powers aren't established during takeoff, the opportunity vanishes forever.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["stage:takeoff", "signal:high-growth-no-barrier"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-failuremode-003",
    "source": "7 Powers",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The Experience Curve (costs declining 15-30% per doubling of units) often leads to false assumptions of Process Power. These gains are typically shared across all firms, not differences in relative position—evidence of arbitrage, not Power.",
    "rationale": "Process Power requires complexity and opacity that create a 'speed limit' for imitation. Most cost improvements from experience diffuse rapidly to competitors. Only hysteresis creates sustainable advantage.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:declining-unit-costs"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "7-powers-example-001",
    "source": "7 Powers",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Netflix's 2011 shift to original content converted streaming content costs from variable to fixed, creating Scale Economies. Cost per subscriber declined as base grew, making competitor economics prohibitive.",
    "rationale": "Ted Sarandos pursued exclusives then originals (House of Cards 2012). This transformed streaming from commodity to defensible business by leveraging Netflix's scale advantage into genuine Power.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "strength": "High",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2011, "end_year": 2014 },
    "outcome": "Worked",
    "context": ["streaming", "media", "scale-economies"]
  },
  {
    "id": "7-powers-example-002",
    "source": "7 Powers",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "BranchOut attempted to challenge LinkedIn via Facebook in 2010-2012, reaching 14 million users. It collapsed because users didn't want to bridge personal and professional networks—network effects were bounded differently.",
    "rationale": "Rick Marini understood Network Economies' winner-take-all dynamic but misread the boundary conditions. LinkedIn and Facebook coexist because their networks serve fundamentally different purposes.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2010, "end_year": 2012 },
    "outcome": "Failed",
    "context": ["social-network", "professional-networking", "network-effects"]
  }
]

