[
  {
    "id": "subscribed-heuristic-001",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "The traditional business school mantra of 'create a hit product, sell as many units as possible, compete on margins' is obsolete. The future belongs to companies that start with customer needs and build services delivering ongoing value, turning customers into subscribers and securing recurring revenue.",
    "rationale": "Subscription-based companies are growing eight times faster than the S&P 500 and five times faster than US retail sales. The shift from ownership to access is industry-agnostic, permeating nearly every sector from media to manufacturing.",
    "lens": ["Business", "Customer"],
    "level": "Strategic",
    "dimension": "Model",
    "applies_when": ["business-model:evaluating", "growth:seeking"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-002",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "If companies don't discover who their customers truly are in the next few years, they risk failure. The only true competitive advantage in the new landscape is a company's relationship with and knowledge of its customers—something competitors cannot easily replicate or reverse-engineer.",
    "rationale": "More than half of the Fortune 500 companies from 2000 are now gone. Those that survived (GE, IBM) did so by shifting from selling physical products to providing digital solutions and outcomes. Customer insight gained through constant data streams from connected services is the new moat.",
    "lens": ["Customer", "Business"],
    "level": "Strategic",
    "dimension": "Model",
    "applies_when": ["competitive-advantage:seeking", "transformation:digital"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-003",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "In the Subscription Economy, churn rate is the most critical factor for sustainable growth. A high churn rate (losing more subscribers than you acquire) can be lethal, leading to an 'Oh Shit Moment.' Taming churn requires understanding customer usage, identifying product gaps, improving adoption, and ensuring continuous value.",
    "rationale": "Unlike transaction businesses where each sale is independent, subscription businesses compound—both positively and negatively. Churn creates a 'leaky bucket' that no amount of acquisition can fill if the rate is too high.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["retention:declining", "growth:stalling"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-004",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Pricing and packaging is arguably the most powerful growth lever for subscription businesses. Unlike product pricing (cost-plus), subscription pricing must reflect outcome-based value. Common mistakes: giving services away free, making pricing too complex, or using flat fees that punish heavy users.",
    "rationale": "When done right, intelligent pricing reduces churn and facilitates acquisition. Companies should constantly optimize pricing (at least annually), using it as the key growth lever. The ability to conduct rapid A/B testing of pricing models is crucial.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["pricing:setting", "growth:optimizing"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-005",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "It is rational for subscription businesses to spend all their profits on growth, as long as churn is controlled and the Growth Efficiency Index (GEI—new recurring revenue dollars per dollar spent on sales and marketing) is healthy. Traditional GAAP profitability can be misleading.",
    "rationale": "Sales and marketing expenses should be treated as capital expenditures (CapEx) for future revenue generation. A high recurring profit margin allows for substantial reinvestment into growth, which is essentially purchasing future annuities.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["investment:deciding", "profitability:evaluating"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-006",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Products become services that are perpetually 'in beta,' evolving based on real-time customer usage data and feedback. The concept of a 'finished' product is dead. Enlist customers as innovation partners, fostering continuous iteration rather than discrete, boom-or-bust release cycles.",
    "rationale": "Gmail remained in 'BETA' for five years. Netflix doesn't use pilots—they leverage vast user data to make informed content decisions. Streaming removes the finality of a product, allowing for shorter development cycles and virtuous feedback loops with subscribers.",
    "lens": ["Customer", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["development:planning", "innovation:continuous"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-007",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Traditional organizational silos (Marketing, Product, Sales, IT, Finance) are obsolete in subscription businesses. The core challenge is helping every employee make the leap from a product-focused mindset to one centered on the customer, where ongoing value delivery is paramount.",
    "rationale": "In the old model, departments operated in isolation optimized for selling discrete units. But in a customer-centric subscription model, these silos become crippling. Problems in one subsystem are often solved by collaboration across multiple departments.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["organization:restructuring", "transformation:subscription"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-008",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Legacy IT architectures built around Stock Keeping Units (SKUs) and discrete orders are a bottleneck for subscription businesses. ERP systems cannot track active subscribers or their lifetime value. The solution is a circular IT architecture that puts subscriber IDs at the center.",
    "rationale": "Legacy systems make it excruciatingly slow and costly to experiment with new pricing models. They have no 'renew' button—they're designed for 'Buy' transactions, not the continuous nature of subscriptions (upgrades, downgrades, suspensions, renewals).",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["systems:legacy", "transformation:subscription"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-heuristic-009",
    "source": "Subscribed",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Growing revenue from existing customers through upsells and cross-sells is a testament to relationship strength. Successful subscription companies cross-sell to about one-third of their customers, which significantly increases retention.",
    "rationale": "Upselling involves selling a more feature-rich edition; cross-selling adds complementary services for a comprehensive solution. This often requires dedicated sales teams focused on existing accounts and continuous service innovation to provide new offerings.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["expansion:planning", "retention:improving"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-failuremode-001",
    "source": "Subscribed",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "When pivoting to subscriptions, companies face internal 'WTF moments' where every department panics: Marketing loses its big launch days, Development loses its production schedule, IT's recent investments become obsolete, and Finance sees quarterly revenues tank.",
    "rationale": "This internal resistance stems from siloed thinking and deeply ingrained product-centric organizational structures. The transformation requires relentless overcommunication with all stakeholders—employees, Wall Street, and customers.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["transformation:announcing", "resistance:internal"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-failuremode-002",
    "source": "Subscribed",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Traditional income statements are problematic for subscriptions because they: (1) don't differentiate between recurring and nonrecurring revenue, (2) match sales/marketing spend to past goods sold rather than future revenue, and (3) are backward-looking, failing to provide forward visibility.",
    "rationale": "Double-entry bookkeeping formalized 500 years ago wasn't designed for subscription businesses. Many successful subscription companies appear unprofitable in traditional GAAP terms but are actually 'awesome businesses' when viewed through the right metrics.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["finance:reporting", "metrics:traditional"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-failuremode-003",
    "source": "Subscribed",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Older subscription models like Columbia House failed due to mismanagement of subscriber relationships—relying on unclear billing practices and difficult cancellations rather than building genuine value. Modern subscription services succeed by focusing on building great services and making it easy for customers to leave if dissatisfied.",
    "rationale": "Customer neglect cannot sustain a business model. The 'gotcha' approach of trapping customers in subscriptions they don't want destroys trust and brand reputation. Success comes from delivering continuous value, not from friction in cancellation.",
    "lens": ["Customer"],
    "level": "Operating",
    "dimension": "Value",
    "applies_when": ["retention:designing", "cancellation:policies"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-failuremode-004",
    "source": "Subscribed",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "In initial customer acquisition, avoid selling to just 'anything with a pulse.' These initial customers define your future. Keep the sales team small and close to this cohort initially, prioritizing learning and relationship building over quick commissions.",
    "rationale": "Wrong-fit customers churn quickly, skew product feedback, and create support burden. Quality over quantity in early customers shapes the trajectory of the entire business. Fast growth with wrong customers is worse than slow growth with right ones.",
    "lens": ["Business", "Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["acquisition:early-stage", "growth:pressure"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-001",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The Subscription Economy Income Statement: Start with ARR → subtract Churn → get Net ARR → subtract Recurring Costs (COGS, R&A, G&A) → get Recurring Profit → subtract Growth Costs (Sales & Marketing as CapEx) → get Net Operating Income → add New ARR → get Ending ARR.",
    "rationale": "This framework reveals why subscription companies may appear unprofitable in GAAP but are actually healthy. It treats sales and marketing as investments in future revenue, not costs against past revenue. Finance becomes 'business model architects' rather than scorekeepers.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["finance:modeling", "metrics:designing"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-002",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "PADRE Operating Model: Pipeline (positioning/awareness) → Acquire (buyer journey to contract) → Deploy (get customers running) → Run (ongoing experience management) → Expand (retention, upsells, advocacy). Supported by People, Product, and Money back-of-house functions.",
    "rationale": "The power of PADRE lies in cross-functional coordination. Problems in one subsystem (e.g., deployment issues) are solved by collaboration across departments. It ensures all institutional knowledge isn't scattered and everyone feels ownership over the customer mission.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["organization:designing", "operations:coordinating"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-003",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Eight Growth Strategies for Subscriptions: (1) Acquire initial customers (quality over quantity), (2) Reduce churn, (3) Expand sales team (when unit economics healthy), (4) Upsells/cross-sells, (5) Launch into new segments, (6) Go international, (7) Maximize acquisition growth, (8) Optimize pricing/packaging.",
    "rationale": "Growth isn't just about selling more units—it's about acquiring more customers, increasing their value, and retaining them longer. Diversifying growth strategies is essential. Sales shifts from transactions to cultivating long-term relationships.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["growth:planning", "strategy:diversifying"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-004",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Two pricing growth levers: (1) Consumption-driven growth—customers pay more as they use more of same capabilities (users, storage, usage). (2) Capability-driven growth—customers grow into service by adding features or higher tiers (silver/gold/platinum). Ideally leverage both.",
    "rationale": "Pick the right 'value metric' that ties consumption to value. Set appropriate unit prices or usage tiers. Avoid having too many subscribers stuck in basic packages—incentivize movement up the capability path, which signals deeper engagement.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Model",
    "applies_when": ["pricing:designing", "packaging:structuring"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-005",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "'Swallowing the fish' transition: Temporary revenue dip (large up-front payments replaced by smaller recurring ones) while investment in new capabilities increases, causing costs to exceed revenue. Navigate with relentless overcommunication to employees, Wall Street, and customers.",
    "rationale": "Adobe gave customers time with parallel sales models for a year before fully transitioning. They shared unprecedented financial information with Wall Street, focusing on ARR targets rather than just GAAP profits. Result: stock soared, 70%+ revenue became recurring.",
    "lens": ["Business", "Feasibility"],
    "level": "Strategic",
    "dimension": "Process",
    "applies_when": ["transformation:executing", "transition:managing"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-pattern-006",
    "source": "Subscribed",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Three Rooms mental model for subscription marketing storytelling: Room One (Context)—the high-level 'why' of broader shifts. Room Two (Value)—marketplace story with specific benefits by role/industry. Room Three (Product)—specific features and mechanics. Start with 'why.'",
    "rationale": "Traditional advertising's effectiveness is waning. In the Subscription Economy, brands are communicated through experiences. Word-of-mouth amplified by social media is the dominant discovery mechanism. Promotional budgets should tell a compelling story starting with context.",
    "lens": ["Customer"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["marketing:positioning", "storytelling:structuring"],
    "strength": "Medium",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-signal-001",
    "source": "Subscribed",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Key subscription metrics: Annual Recurring Revenue (ARR), Churn Rate, Customer Lifetime Value (LTV), Customer Acquisition Cost (CAC), Average Revenue Per Account (ARPA), Growth Efficiency Index (GEI = new recurring revenue per dollar spent on S&M).",
    "rationale": "These metrics provide forward visibility that traditional income statements lack. ARR is the predictable revenue expected annually from subscribers. GEI indicates whether growth investments are rational. LTV > CAC validates unit economics.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["metrics:selecting", "health:monitoring"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-signal-002",
    "source": "Subscribed",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Financial Times uses 'multiple of three factors' (recency, frequency, volume) to gauge reader engagement and identify churn risks. This RFV analysis reveals which subscribers are at risk of leaving before they actually churn.",
    "rationale": "Proactive identification of at-risk subscribers enables intervention before cancellation. Engagement metrics are leading indicators; churn is a lagging indicator. The ability to predict and prevent churn is worth more than acquiring new customers.",
    "lens": ["Customer", "Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["churn:predicting", "engagement:monitoring"],
    "strength": "Medium",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-001",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Adobe's subscription pivot: In 2011, announced plan to decrease short-term revenue by shifting from perpetual licenses to subscriptions. Despite initial stock market trepidation, pursued relentless overcommunication. Result: stock soared, over 70% of revenue became recurring.",
    "rationale": "Adobe faced stagnant user growth and lack of financial buffer during 2008 recession due to transactional model. They were 'stuck in the box' while digital publishing boomed. The 'swallow the fish' transition required convincing employees, Wall Street, and customers.",
    "lens": ["Business"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["software", "transformation", "enterprise"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-002",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Fender launched Fender Play, a subscription-based online teaching service. Recognizing that 90% of new guitarists quit within a year, their goal shifted from selling guitars to 'creating musicians.' By reducing abandonment rate, they could double their market size.",
    "rationale": "Demonstrates how companies wrap digital services around physical products. Focus shifted from reseller margins to engagement rates and lifetime customer value. The subscription service makes the hardware more valuable, not the other way around.",
    "lens": ["Customer", "Business"],
    "level": "Product",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["hardware", "digital-services", "retention"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-003",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Netflix grew from zero to 100 million subscribers in ten years. They invest billions in original content not to sell 'units' but to attract new subscribers and extend lifetime value of existing ones. They don't use pilots—they leverage vast user data for content decisions.",
    "rationale": "Shifts focus from unpredictable box office to stable, predictable revenue streams, allowing for bolder creative risks. Their 'giant brain' of viewing history, ratings, searches, device info, and social media feedback reduces guesswork in traditional TV production.",
    "lens": ["Business", "Customer"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["media", "streaming", "data-driven"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-004",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Komatsu's Smart Construction: Using drones and AI, they survey job sites in minutes (instead of weeks), create 3D topographical models, and optimize project plans down to the hour. Semi-autonomous excavators execute the plan. Shifted from selling equipment to 'dirt removal as a service.'",
    "rationale": "The core insight for manufacturers: view products as whole systems that generate data, enabling outcomes rather than just physical goods. Move from bill of sale to service-level agreement. IoT transforms the value proposition from hardware to intelligence.",
    "lens": ["Business", "Customer"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["manufacturing", "iot", "outcomes"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-005",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "New York Times: Over 60% of revenue now comes directly from readers, exceeding print advertising revenue for first time in 2017. Its freemium model, international expansion, and focus on subscriber relationships (rather than chasing clicks for ads) mirrors successful SaaS companies.",
    "rationale": "Proves quality journalism supported by dedicated readers is a robust business model. Digital subscriptions surging. Reader revenue is far more stable than ad revenue and allows focus 100% on value for audience rather than clickbait for advertisers.",
    "lens": ["Business"],
    "level": "Strategic",
    "dimension": "Model",
    "outcome": "Worked",
    "context": ["media", "publishing", "reader-revenue"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-006",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Autodesk successfully navigated channel transformation by reinstrumenting software for subscriptions, then educating resellers. They offered resellers annual maintenance plans and shared new user behavioral data. Created 'win-win-win' scenario making resellers more successful with newfound subscriber knowledge.",
    "rationale": "In subscription economy, manufacturers need direct customer relationships without alienating channel partners. The goal is making the channel an extension of direct relationship, not a replacement. Shared data creates mutual benefit.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "outcome": "Worked",
    "context": ["software", "channels", "transformation"],
    "strength": "High",
    "evidence_grade": "Primary"
  },
  {
    "id": "subscribed-example-007",
    "source": "Subscribed",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Columbia House failed due to mismanagement of subscriber relationships—relying on unclear billing practices and difficult cancellations rather than building genuine value. Customer neglect cannot sustain a subscription business model.",
    "rationale": "Counter-example demonstrating that subscription success requires delivering continuous value, not trapping customers through friction. The 'gotcha' approach destroys trust. Modern services succeed by making it easy for customers to leave if dissatisfied.",
    "lens": ["Customer"],
    "level": "Operating",
    "dimension": "Value",
    "outcome": "Failed",
    "context": ["media", "retention", "dark-patterns"],
    "strength": "High",
    "evidence_grade": "Primary"
  }
]

