[
  {
    "id": "the-crux-heuristic-001",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "The crux is the most important part of a set of challenges that is addressable and has a good chance of being solved by coherent action. It embodies judgment about importance, difficulty, and ability to focus resources.",
    "rationale": "Effective strategy requires isolating a critical challenge from the buzzing confusion. Not all problems are equally important or solvable. The crux is where commitment to action will surmount critical obstacles.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:strategic-planning", "signal:complex-challenges"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-002",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "An Addressable Strategic Challenge (ASC) passes joint filters of critical importance and addressability. Importance: threatens core values/existence or major opportunity. Addressability: solvable given skills, resources, timeframe.",
    "rationale": "Difficult, important challenges are where the crux usually lies. Filtering helps avoid wasting effort on unsolvable problems or trivial issues. Both dimensions must be satisfied.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:challenge-analysis"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-failuremode-001",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Mistaking goals for strategy is common. Proclaiming goals like '15% profit growth' without diagnosis dodges the responsibility to lead. Good objectives are derived from problem-solving, not stated as inputs.",
    "rationale": "A goal is a decision lacking foundational analysis. Strategy is a considered judgment about what to do, shaped by insights about changes, skills, resources, and competition. Goals are outcomes, not starting points.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:performance-targets-as-strategy"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-failuremode-002",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "When multiple values or ambitions conflict without prioritisation, they reduce the space of possible action to a 'null set' where no feasible policy satisfies all desires. This creates indecision and half-measures.",
    "rationale": "US Vietnam involvement exemplified this: wanting to avoid losing but also avoiding major war, desiring victory but not full military fury. The crux in such cases is the strongest conflicting policies requiring relaxation.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:conflicting-priorities", "culture:consensus-seeking"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-003",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Coherent actions support one another synergistically, going beyond merely not contradicting each other to create additional power. Incoherent actions nullify efforts and waste resources.",
    "rationale": "Amazon's customer-centricity, smooth website, rapid delivery, easy returns all work together. Southwest's original policies (non-union, short turnaround, non-major airports) were coherent and hard to emulate.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:strategy-design"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-failuremode-003",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Strategy deduction from frameworks fails. Trying to derive strategy from Porter's generic types or desired financial goals misses the mark. Strategy is a design, not a deduction—non-obvious, embodying purpose, a product of insight.",
    "rationale": "Paradigm Corp tried to deduce 'broad differentiation' from generic types. Frameworks call attention to what might be important but don't guide specific actions. Strategy requires judgment, not algorithms.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["signal:framework-driven-planning"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-004",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "To make long-term challenges addressable, strategists must break them into smaller 'chunks' that can be tackled in the near term. Define proximate objectives—specific, achievable tasks within 18 months.",
    "rationale": "This isn't mere tactics but essential for defining achievable steps. Shorter time horizons for objectives facilitate agreement on priorities by reducing 'life-or-death' struggle over long-term commitments.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Sequencing",
    "applies_when": ["context:complex-challenges", "stage:planning"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-pattern-001",
    "source": "The Crux",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Strategy is a journey, not a fixed plan. Organisations face an ongoing series of challenges, each requiring tailored responses. An organisation's ambitions shift and escalate with each challenge met.",
    "rationale": "Salesforce evolved from attracting developers, to bypassing IT, to annual contracts, to AppExchange platform, to Chatter. Each step involved design for dealing with the challenge, not choosing from given alternatives.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:dynamic-market"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-005",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Five basic sources of advantage: information (knowing what others don't), know-how (skills/patents), position (reputation/brand/systems), efficiency (lower costs), and management of systems (speed/precision).",
    "rationale": "These are asymmetries that can be turned into competitive edge. Without them, financial projections are wishful thinking. Success is rarely found by cutting prices in commodity markets.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["context:competitive-analysis"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-006",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Close coupling of activities—especially new, inventive combinations—is a subtle source of advantage. Bringing together skills and ideas that haven't been combined creates deep, hard-to-duplicate competitive positions.",
    "rationale": "iPhone, Amazon, Wright Brothers, Alice Waters all exemplify coupling across different knowledge bases. This creates advantage because replicating the combination is harder than copying individual elements.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["signal:commodity-pressure", "goal:defensibility"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-failuremode-004",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Using the wrong analogy leads to strategic failure. Nokia and Microsoft viewed smartphones as akin to PCs, expecting 'open systems' to win via volume. This false analogy led them to dismiss iPhone's potential.",
    "rationale": "PC clones emerged from IBM's IP mistakes; Apple made no such blunders. PC growth was business-driven; smartphone growth was consumer-driven. The analogy-based prediction failed catastrophically.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["signal:analogical-reasoning", "market:disrupted"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-example-001",
    "source": "The Crux",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "SpaceX identified the crux of high launch costs as rocket non-reusability. Musk realised fuel was cheaper than hardware and used extra fuel for soft landings. This audacious insight led to dramatic cost reductions.",
    "rationale": "While others focused on complex thermal tiles, Musk redesigned the problem. Coherent policies of complete redesigns, low-cost manufacturing, and limited subcontractors followed from this crux identification.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "strength": "High",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2002, "end_year": 2015 },
    "outcome": "Worked",
    "context": ["aerospace", "hardware", "vertical-integration"]
  },
  {
    "id": "the-crux-example-002",
    "source": "The Crux",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Marvel's Kevin Feige identified the crux as making non-Spider-Man/X-Men characters valuable. Audacious leap: create a shared fictional universe funded by an independent studio, leading to the Marvel Cinematic Universe.",
    "rationale": "This transformed characters with limited standalone appeal into an interconnected franchise worth billions. The crux was the problem of character value; the leap was the shared universe concept.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "strength": "High",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2008, "end_year": 2019 },
    "outcome": "Worked",
    "context": ["entertainment", "IP", "franchise"]
  },
  {
    "id": "the-crux-failuremode-005",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Confusing strategy with management fails. 'Driving results' (motivating/measuring performance) is management work. Strategy work defines goals by recognising and understanding challenges. Both are crucial but different.",
    "rationale": "McNamara's focus on 'body count' metrics in Vietnam without sound strategy led to failure. Execution without strategy is putting the cart before the horse.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:KPI-obsession", "culture:metrics-driven"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-failuremode-006",
    "source": "The Crux",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The '90-Day Derby'—quarterly earnings focus—distracts from true strategy. Earnings are harvest of past actions, not current management. Pressure to hit targets induces wasteful decisions and short-term thinking.",
    "rationale": "Softways bought technology for $175M rather than developing internally for $20M to avoid hitting earnings. Research shows no strong connection between incentive pay tied to stock price and corporate performance.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:quarterly-pressure", "market:public-company"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "the-crux-heuristic-007",
    "source": "The Crux",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "To weed the garden for growth, simplify by removing needless activities and business units that don't generate surplus. Concentrating to grow works because value creation on a too-large, diversified base goes unnoticed.",
    "rationale": "S&P Global sold Business Week, education, construction publications. Despite initial revenue drops, focus on financial-information led to 7% revenue CAGR, 19% EBITDA CAGR, 24% stock price growth (2012-2019).",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Scope",
    "applies_when": ["signal:conglomerate-discount", "goal:focus"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

