[
  {
    "id": "thinking-in-bets-failuremode-001",
    "source": "Thinking in Bets",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Resulting causes founders to change strategy based on outcomes rather than decision process quality, reinforcing bad decisions that got lucky and abandoning good decisions that got unlucky.",
    "rationale": "When we judge decisions by their outcomes alone, we learn the wrong lessons. A drunk driver who gets home safely concludes drunk driving is fine. A CEO who fires someone and sees the company struggle assumes the firing was wrong, even if the process was sound.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["outcome:recent", "feedback:fast"],
    "breaks_when": ["process:documented", "analysis:pre-outcome"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-001",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Ask 'Wanna bet?' before committing to a belief or decision. Willingness to stake money forces honest assessment of confidence levels and triggers objective vetting of evidence.",
    "rationale": "Being willing to bet money on a belief forces us to be more honest with ourselves about certainty. The question promotes objective evaluation, makes implicit risk explicit, and moves us away from black-and-white thinking.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["confidence:high", "stakes:significant"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-failuremode-002",
    "source": "Thinking in Bets",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Self-serving bias causes founders to attribute wins to their skill and losses to bad luck, preventing them from learning from mistakes or questioning successful decisions that were actually lucky.",
    "rationale": "We predictably take credit for good outcomes and blame bad ones on external factors. This blocks learning by preventing examination of mistakes and reinforcing decisions that shouldn't be reinforced.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["feedback:personal", "outcome:emotional"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-002",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Separate outcome quality from decision quality by asking: 'Was this a good bet given what I knew at the time?' not 'Did this work out?'",
    "rationale": "Decisions with 24% chance of success aren't wrong because they fail. A decision with sound probabilistic reasoning can still produce bad outcomes due to luck. Focus on process quality, not result.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-003",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Express confidence as a probability (0-100%) rather than binary certainty. This acknowledges what you don't know and invites others to share disconfirming information.",
    "rationale": "Expressing confidence as degree provides more accurate world representation, reduces resistance to disagreement, increases credibility, invites collaboration, and signals to listeners that information needs vetting.",
    "lens": ["Business", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-failuremode-003",
    "source": "Thinking in Bets",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Smarter people are often more blind to their own biases while being better at spotting bias in others, making intelligence a liability without structured debiasing practices.",
    "rationale": "Research shows more numerate individuals are better at spinning numbers to support pre-existing beliefs. Intelligence alone cannot overcome evolutionary wiring to protect beliefs. The smarter you are, the better you rationalize.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["team:small", "founder:technical"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-004",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Before sharing details of a decision with advisors, omit the outcome to prevent infecting their analysis with hindsight bias and resulting.",
    "rationale": "Knowing how something turned out creates a conflict of interest that leads to resulting. Outcome-blind analysis helps ensure disinterested evaluation of the decision process itself.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["feedback:seeking", "advisor:available"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-pattern-001",
    "source": "Thinking in Bets",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Groups without explicit truthseeking charters naturally drift toward confirmatory thought and become echo chambers, even among smart, well-intentioned people.",
    "rationale": "Federal judges succumb to groupthink on politically similar panels. Social psychology lacks viewpoint diversity. Supreme Court clerk hiring has homogenized. We gravitate toward people who think like us.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["team:homogeneous", "culture:unstructured"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-005",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Run a premortem before major decisions: imagine the decision failed completely, then identify what caused the failure. This gives permission to surface problems that groupthink would suppress.",
    "rationale": "Premortems implement organized skepticism by redefining 'team player' as the person who identifies potential problems. Unlike postmortems, they prevent failure rather than analyzing it afterward.",
    "lens": ["Business", "Feasibility"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["decision:irreversible", "stakes:high"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-006",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use the 10-10-10 rule: ask how you'll feel about this decision in 10 minutes, 10 months, and 10 years. This breaks temporal discounting and recruits future-self perspective.",
    "rationale": "In-the-moment thinking magnifies present issues. Mental time travel engages deliberative brain areas and helps overcome impulsive decisions by putting current feelings in context of past and future.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["emotion:high", "pressure:immediate"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-failuremode-004",
    "source": "Thinking in Bets",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Tilt—making emotionally charged decisions after negative outcomes—degrades decision quality. The amygdala can hijack the prefrontal cortex, shutting down rational thinking.",
    "rationale": "Recent negative fluctuations distort our view and drive emotional responses rather than overall performance assessment. Making decisions while emotionally unhinged leads to irrational choices.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["outcome:negative", "timing:recent"],
    "breaks_when": ["contract:precommitment", "cooldown:enforced"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-007",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Create Ulysses contracts—precommitment strategies where past-self constrains present-self from predictable irrationality. Set loss limits, price ceilings, or decision rules before emotions engage.",
    "rationale": "Like Odysseus binding himself to the mast, precommitments prevent irrational action when we know we'll be compromised. Even partial hurdles create stop-and-think moments that trigger deliberative thought.",
    "lens": ["Business", "Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["bias:predictable", "trigger:known"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-pattern-002",
    "source": "Thinking in Bets",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "We field others' outcomes with opposite bias: blaming their failures on their fault while attributing their successes to luck. This blocks learning from watching others.",
    "rationale": "We hold others to different standards than ourselves. In zero-sum comparisons, our self-serving interpretation requires corresponding attribution for others. Schadenfreude reflects this competitive drive.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["comparison:peer", "outcome:visible"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-heuristic-008",
    "source": "Thinking in Bets",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Evaluate ideas independent of source (universalism). Imagine the same message from a source you value more or less to disentangle message from messenger.",
    "rationale": "We discount valid ideas from 'bad' sources and accept weak ideas from respected ones. Omitting source when presenting ideas, or imagining different sources, helps objectively assess substance.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["source:unfamiliar", "idea:challenging"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "thinking-in-bets-example-001",
    "source": "Thinking in Bets",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Pete Carroll's Super Bowl XLIX pass play that resulted in interception was probabilistically sound—interception probability was extremely low, and the play had strategic advantages—but was widely condemned due to resulting.",
    "rationale": "Carroll acknowledged 'worst result of a call ever' but maintained it would have been brilliant if successful. The public focused on outcome, ignoring strategic rationale and low interception probability in that situation.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2015, "end_year": 2015 },
    "outcome": "Failed",
    "context": ["sports", "high-stakes", "public-scrutiny"]
  }
]

