[
  {
    "id": "understanding-michael-porter-heuristic-001",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Compete to be unique, not to be the best. Competing to be 'the best' leads to a zero-sum dynamic where offerings converge and competition devolves into price wars.",
    "rationale": "In most industries there is no single 'best' because customers have diverse needs. Competing to be unique through distinctive value is positive-sum, allowing multiple companies to thrive by serving different needs.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:competitive-strategy"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-002",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Competition for profits involves five forces: customers, suppliers, substitutes, new entrants, and existing rivals. The collective strength of these forces shapes industry profitability.",
    "rationale": "Industry structure determines average prices, costs, and required investment. Strong forces put pressure on prices or costs, reducing attractiveness. Structure, not growth or technology alone, determines profitability.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["context:industry-analysis"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-003",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Competitive advantage means sustainably higher profitability than rivals, achieved by operating at lower cost, commanding premium price, or both. Measured by return on invested capital versus industry average.",
    "rationale": "ROIC is the best measure as it reflects how effectively a company uses resources to generate economic value. Strategic choices aim to shift relative price or relative cost favourably.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["context:performance-measurement"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-failuremode-001",
    "source": "Understanding Michael Porter",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Operational effectiveness—performing similar activities better than rivals—rarely provides sustainable competitive advantage because best practices are easily copied. Advantage arises from different activities.",
    "rationale": "While OE is essential for performance, competition quickly diffuses best practices. Competitive advantage comes from choosing a different configuration of activities, not doing the same things better.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["signal:best-practice-focus", "context:commoditisation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-004",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "A good strategy requires a distinctive value proposition AND a specifically tailored value chain. A value proposition without a different set of activities to deliver it has no strategic relevance.",
    "rationale": "The value proposition defines which customers, needs, and price. Competitive advantage lies in performing different activities or performing similar activities differently. Strategy integrates demand side and supply side.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:strategy-formulation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-005",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Trade-offs are strategy's linchpin. They create either-or dynamics that impose economic penalties on imitators, making it difficult to match a successful strategy without compromising their own positions.",
    "rationale": "If there are no trade-offs, good ideas can be easily copied. Trade-offs can stem from incompatible features, inconsistent activities, or conflicting image/reputation. Robust strategies involve multiple trade-offs across the value chain.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:competitive-defence", "goal:sustainability"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-failuremode-002",
    "source": "Understanding Michael Porter",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Straddling—trying to match a rival's successful position while maintaining your own—usually fails because it doesn't embrace necessary trade-offs, leading to inefficiencies and compromising both positions.",
    "rationale": "Companies often undermine strategies by adding features to appeal to more customers, relaxing essential trade-offs. Deciding which customers or needs NOT to serve is as important as deciding which to serve.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["signal:competitive-imitation", "context:market-pressure"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-006",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Fit describes how activities within the value chain reinforce each other. It amplifies competitive advantage and sustainability by making the whole system harder to imitate than any single part.",
    "rationale": "Rivals must copy a whole system of interdependent activities, not just isolated best practices. Fit can lower costs or raise willingness to pay. The complexity of interconnected activities raises barriers to imitation.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["context:activity-system-design"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-failuremode-003",
    "source": "Understanding Michael Porter",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Competitive advantage comes from the entire system of activities, not just a few 'core competences.' Focusing on isolated skills can lead to imitation and competitive convergence.",
    "rationale": "Activity system maps reveal that strength comes from interconnection. Outsourcing activities that could be tailored to strategy, especially those with strong complementarities, limits opportunities for uniqueness and fit.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["signal:core-competence-focus", "context:outsourcing-decisions"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-007",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Continuity over time enables strategy. It allows deepening of tailored value chain, trade-offs, and fit. Frequent strategy shifts are costly and undermine ability to build sustainable competitive advantage.",
    "rationale": "Strategy takes time to develop. Continuity reinforces identity/brand, helps suppliers contribute to advantage, and fosters unique capabilities. Successful companies innovate within core value proposition, not by abandoning it.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["context:strategic-planning", "signal:pressure-to-pivot"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-failuremode-004",
    "source": "Understanding Michael Porter",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Embracing flexibility as an alternative to strategy in uncertain times is flawed. Flexibility without direction means an organisation never stands for or becomes good at anything, leading to mediocrity.",
    "rationale": "Strategy does not require predicting the future in detail. It's a bet that chosen customers, needs, and essential trade-offs will be enduring. A clear strategy helps prioritise and focus resources for effective adaptation.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["signal:uncertainty-paralysis", "culture:anti-commitment"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-signal-001",
    "source": "Understanding Michael Porter",
    "type": "Signal",
    "purpose": "Detect",
    "claim": "Industries with chronic low profitability despite constant effort signal structural problems in the five forces. Airlines exemplify this: intense rivalry, powerful buyers, substitutes, and low barriers compound against profits.",
    "rationale": "Structure, not execution quality, determines industry-average profitability. Analysing trends in forces helps anticipate whether profitability will shift. Position where forces are weakest or reshape the structure.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "",
    "applies_when": ["signal:low-industry-margins", "context:industry-selection"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-pattern-001",
    "source": "Understanding Michael Porter",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Value propositions have three elements: which customers to serve, which needs to meet, and at what relative price. Strategic choices can start with any element, leading to the others.",
    "rationale": "Needs-based positioning serves a particular need for a mix of customers. Price-based positioning serves overserved customers with lower price or underserved customers with premium value. The goal is a unique, profitable combination.",
    "lens": ["Customer", "Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["context:value-proposition-design"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-heuristic-008",
    "source": "Understanding Michael Porter",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "The value chain disaggregates a company into strategically relevant activities. All costs arise from activities; all differentiation is created by them. Compare to industry value chain to identify advantage sources.",
    "rationale": "Rigorous analysis of price and cost drivers within activities reveals opportunities to enhance buyer value or reduce costs. Differences in activities performed, or how they're performed, are the source of competitive advantage.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["context:competitive-analysis"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "understanding-michael-porter-failuremode-005",
    "source": "Understanding Michael Porter",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The belief that companies must be number 1 or 2, or that size drives competitive success, can lead to pursuing unprofitable growth and destructive price cutting. Many industries have multiple scale curves based on different needs.",
    "rationale": "Winner-takes-all thinking overlooks that competing to be unique allows multiple winners. Drawing on warfare and sports analogies is misleading—business allows multiple winners through serving different needs effectively.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["signal:market-share-obsession", "culture:growth-at-all-costs"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

