[
  {
    "id": "working-backwards-heuristic-001",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Good intentions don't work. Mechanisms do. To maintain principles at scale, build consistent, repeated processes that reinforce desired behaviors. Culture is sustained through structural mechanisms, not slogans.",
    "rationale": "As Amazon grew, it became impossible for Bezos to personally vet every hire or decision. Formal mechanisms—annual planning (OP1/OP2), compensation structures, hiring processes—ensure principles are embedded in daily operations rather than relying on individual judgment.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["company-size:scaling", "goal:culture-preservation"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-heuristic-002",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Focus on controllable input metrics, not output metrics. Output metrics like revenue and profit are lagging indicators you can't directly control. Input metrics like selection, price, and convenience are the levers that drive outputs.",
    "rationale": "Amazon's philosophy is to improve input metrics relentlessly because these can be directly manipulated. The flywheel model shows how controllable inputs (lower prices, wider selection) drive output metrics (traffic, growth) in a virtuous cycle.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:performance-management", "goal:growth"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-heuristic-003",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Use the PR/FAQ to work backwards from the desired customer experience. Write the press release first, then the FAQs, forcing teams to confront viability, cost, and challenges before committing resources. Most PR/FAQs should not result in launches.",
    "rationale": "Working Backwards reverses conventional product development. The PR/FAQ shifts perspective to the customer, demonstrates thorough thinking, anticipates challenges, and helps determine viability before significant investment. It's a filter, not a greenlight mechanism.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Scope",
    "applies_when": ["stage:product-definition", "goal:validate-idea"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-heuristic-004",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Replace PowerPoint with six-page narratives. Written narratives convey seven to nine times more information per page than slides and force authors to think and synthesize deeply, organize ideas logically, and anticipate counterarguments.",
    "rationale": "PowerPoint was banned from S-Team meetings because the format was ineffective for complex, multivariate discussions. Edward Tufte's argument that bullet lists damage complex analysis influenced the shift. Ideas, not presentation skills, should drive decisions.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:executive-meetings", "goal:decision-quality"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-heuristic-005",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Appoint single-threaded leaders for major initiatives. A single person, free from competing responsibilities, should own each initiative and lead a separable, largely autonomous team. This delivers high-velocity innovation even at massive scale.",
    "rationale": "Growth increases communication lines and dependencies exponentially. Single-threaded leaders working on separable teams can build and deploy without extensive coordination. This requires clearly demarcating ownership boundaries and reducing organizational dependencies.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:high-priority-initiative", "company-size:scaling"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-pattern-001",
    "source": "Working Backwards",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "The Bar Raiser flywheel: each new hire is expected to raise the bar, progressively strengthening the team. Rigorous hiring with trained interviewers, structured behavioral interviews, and veto power creates a positive feedback loop on talent quality.",
    "rationale": "The Bar Raiser process uses seasoned interviewers free from urgency bias who can veto hires. STAR method behavioral interviews assess past behavior against leadership principles. Written feedback submitted before discussion prevents groupthink.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["stage:scaling", "goal:talent-density"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-failuremode-001",
    "source": "Working Backwards",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "The 'institutional no' kills innovation by commission. Large organizations reflexively reject risky new ideas, leading to errors of omission. Overcoming this requires executive intervention to push past cost concerns and uncertainty about customer behavior.",
    "rationale": "Amazon faced resistance to Prime due to cost concerns despite data showing customer desire. Jeff's 'house-on-fire' email to launch a shipping membership program by year-end was a decisive move to overcome this inertia.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["context:new-initiative", "company-size:large"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-failuremode-002",
    "source": "Working Backwards",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Competitor obsession leads to rushed, inferior products. Amazon's Unbox video service launched with numerous customer experience problems because the team prioritized competing with Apple over delivering a great experience. This was a departure from customer obsession.",
    "rationale": "Unbox suffered from slow downloads, buggy DRM, and Windows-only compatibility. The disastrous live demo symbolized these issues. Rushing to market to compete, rather than prioritizing customer experience, was a key mistake.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Quality",
    "applies_when": ["signal:competitive-pressure", "context:product-launch"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-failuremode-003",
    "source": "Working Backwards",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Urgency bias in hiring leads to talent dilution. The pressure to fill open roles quickly causes overlooking candidate flaws and shortcuts in process, with devastating long-term consequences. Hire slowly even under pressure.",
    "rationale": "In Amazon's early rapid growth phase, hiring standards were inconsistent as new, inexperienced people hired others. This dilution of talent threatened the culture. The Bar Raiser program was created specifically to counter this tendency.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["context:rapid-growth", "signal:open-headcount-pressure"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "working-backwards-example-001",
    "source": "Working Backwards",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon's Kindle was developed using the Working Backwards process. Focusing on the desired customer experience (excellent screen, easy ordering, vast selection) led to breakthroughs like Whispernet and E Ink that wouldn't have emerged from a skills-forward process.",
    "rationale": "Despite no prior hardware experience, Amazon decided to build its own e-reader to control the reading experience. The overarching design principle was to make the device unobtrusive, allowing readers to connect directly with content.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Experience",
    "applies_when": ["context:new-capability-required", "goal:customer-experience"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2004, "end_year": 2007 },
    "outcome": "Worked",
    "context": ["hardware", "digital-media"]
  },
  {
    "id": "working-backwards-example-002",
    "source": "Working Backwards",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon Prime launched in February 2005 after Jeff's 'house-on-fire' email demanding launch by year-end, despite internal disagreement about costs. It was a long-term investment taking years to reach mass adoption but became a key driver of Amazon's growth.",
    "rationale": "Data showed shipping costs deterred customers but the 'institutional no' resisted a free shipping program. Teams fully committed despite concerns ('Disagree and Commit'), leveraging existing building blocks like Fast Track and DVD rental subscription infrastructure.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Model",
    "applies_when": ["signal:growth-deceleration", "goal:customer-loyalty"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2004, "end_year": 2005 },
    "outcome": "Worked",
    "context": ["e-commerce", "subscription"]
  },
  {
    "id": "working-backwards-example-003",
    "source": "Working Backwards",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "AWS emerged from Amazon's Associates program providing product data in XML format in 2002. Developers used the data in innovative ways Amazon hadn't anticipated (Amazon Lite, Amazon Graph), demonstrating the power of enabling others to build.",
    "rationale": "Jeff quickly recognized the potential, noting the unusual adoption rate and innovation from developers. The shift to a technical audience required new documentation and support. AWS formalized software developers as a new customer segment for Amazon.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["context:platform-building", "signal:unexpected-usage"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2002, "end_year": 2006 },
    "outcome": "Worked",
    "context": ["cloud-computing", "platform"]
  },
  {
    "id": "working-backwards-example-004",
    "source": "Working Backwards",
    "type": "Example",
    "purpose": "Illustrate",
    "claim": "Amazon's Unbox video service launched in 2006 with numerous customer experience problems including slow downloads, buggy DRM, and Windows-only compatibility. The disastrous live demo symbolized rushing to compete with Apple rather than prioritizing customer experience.",
    "rationale": "Unbox was stuck in the middle of the value chain without control over content or playback devices. The author's self-assessment and Jeff's 'Howard Hughes' analogy highlighted the culture of learning from mistakes and raising the bar on quality.",
    "lens": ["Customer"],
    "level": "Product",
    "dimension": "Quality",
    "applies_when": ["signal:competitive-pressure"],
    "strength": "Medium",
    "evidence_grade": "Secondary",
    "timeframe": { "start_year": 2006, "end_year": 2006 },
    "outcome": "Failed",
    "context": ["digital-media", "streaming"]
  },
  {
    "id": "working-backwards-heuristic-006",
    "source": "Working Backwards",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Treat morale as an output metric, not an input. Focus on improving the inputs that enable builders to invent and delight customers—freedom to build, reduced dependencies, autonomy—rather than relying on morale-boosting programs.",
    "rationale": "Amazon's approach to morale focuses on removing organizational and technical dependencies that frustrate builders. Separable teams with single-threaded leadership increase engagement by giving creators control over their destiny.",
    "lens": ["Feasibility"],
    "level": "Operating",
    "dimension": "Process",
    "applies_when": ["signal:morale-concerns", "goal:retention"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

