[
  {
    "id": "zero-to-one-heuristic-001",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Avoid copying existing models; strive for genuine innovation that creates something entirely new. Copying provides short-term gains but limits long-term growth. True innovation offers unique value and disrupts markets.",
    "rationale": "Going from zero to one means creating something that has never existed before. Incremental improvements (one to n) face more competition and commoditisation. Originality creates monopoly conditions that enable sustained profitability.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["stage:early", "goal:defensibility"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-002",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Start with a niche market where you can dominate, then expand. Focusing on a small market allows deep customer understanding, strong brand presence, and loyal customer base before tackling larger markets.",
    "rationale": "It's easier to dominate a small market than compete in a large one. A monopoly of a small market generates profits and learning that fund expansion. Amazon started with books; Facebook started with Harvard students.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Audience",
    "applies_when": ["stage:early", "constraint:resource-limited"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-003",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Monopolies, when achieved through innovation and differentiation, drive progress. They have resources to invest in R&D, take risks on new products, and drive down costs through economies of scale.",
    "rationale": "Competition destroys profits. Monopolies can afford to think long-term and invest in innovation because they're not fighting for survival. Google's monopoly profits fund ambitious projects like self-driving cars.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Positioning",
    "applies_when": ["goal:long-term-value"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-004",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Develop proprietary technology that gives your company an edge and protects from competition. Proprietary technology should be at least 10x better than the closest substitute to create a real monopolistic advantage.",
    "rationale": "Proprietary technology is the most substantive advantage because it makes your product difficult or impossible to replicate. Anything less than 10x improvement can be seen as marginal and won't change customer behaviour.",
    "lens": ["Feasibility"],
    "level": "Strategy",
    "dimension": "Differentiation",
    "applies_when": ["product:technology-driven"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-pattern-001",
    "source": "Zero to One",
    "type": "Pattern",
    "purpose": "Evaluate",
    "claim": "Definite optimism combines belief in the future with clear, actionable plans. Definite optimists set specific goals, develop strategies to achieve them, and execute with determination. This beats vague hoping.",
    "rationale": "Indefinite optimism—hoping for a better future without a clear plan—leads to reliance on luck. Definite optimists overcome obstacles and adapt because they have concrete direction. Planning creates optionality within a framework.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:strategic-planning"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-005",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Secrets—hidden opportunities overlooked by others—are the source of great companies. Seek out secrets in overlooked markets, emerging technologies, or unique insights into customer behaviour.",
    "rationale": "If everyone knew about an opportunity, it would already be exploited. Conventional thinking leads to conventional outcomes. The best secrets are hard but achievable truths that others haven't discovered.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Problem",
    "applies_when": ["context:opportunity-search"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-failuremode-001",
    "source": "Zero to One",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Don't focus solely on short-term financial metrics. Conventional valuations fail to capture innovative companies' long-term potential. True value lies in future potential for growth, not current revenue.",
    "rationale": "LinkedIn lost money for years before becoming profitable; Twitter's value came from potential, not current financials. Metrics like customer acquisition cost and lifetime value better assess true value than quarterly profits.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Capital",
    "applies_when": ["stage:early", "market:venture-backed"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-006",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Distribution is crucial for getting products to customers. Understand distribution channels and develop a comprehensive strategy. Even great products fail without effective distribution.",
    "rationale": "Customers won't buy what they don't know exists. Distribution isn't just logistics—it's the entire process of reaching customers. Superior distribution can trump superior product in many markets.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "Channel",
    "applies_when": ["context:go-to-market"],
    "strength": "High",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-failuremode-002",
    "source": "Zero to One",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Avoid investing in overhyped markets (bubbles). Learn from cleantech's failures—most companies failed despite massive investment because they couldn't answer seven key questions about technology, timing, team, and distribution.",
    "rationale": "Bubbles occur when asset prices rise due to speculation without corresponding value increases. Cleantech failed because companies couldn't differentiate, had poor timing, and faced competition from cheap fossil fuels.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["market:hyped", "signal:rapid-investment"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-007",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Master timing: enter a market when conditions are ripe for growth. Avoid entering too early (immature technology, unready market) or too late (well-established competition makes gaining share difficult).",
    "rationale": "Timing is crucial—being right at the wrong time is the same as being wrong. The best entrepreneurs find the moment when technology and market conditions align to make their vision achievable.",
    "lens": ["Business"],
    "level": "Strategy",
    "dimension": "*",
    "applies_when": ["context:market-entry"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-008",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Technology should complement human abilities rather than replace them. Focus on solutions that augment human capabilities. By leveraging strengths of both humans and technology, you solve complex challenges.",
    "rationale": "Computers are good at processing data; humans are good at making judgements. The most valuable companies will be built around human-computer symbiosis, not pure automation. This creates defensible advantages.",
    "lens": ["Feasibility"],
    "level": "Product",
    "dimension": "Architecture",
    "applies_when": ["product:AI-enabled", "context:automation-decisions"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-failuremode-003",
    "source": "Zero to One",
    "type": "FailureMode",
    "purpose": "Warn",
    "claim": "Excessive salaries can create short-term thinking and hinder long-term growth. Avoid situations where employees focus on maximising compensation rather than company success. Align individual incentives with company goals.",
    "rationale": "A cash-poor executive remains motivated to increase the company's value. High cash compensation teaches people to claim value rather than create it. Equity aligns incentives with long-term outcomes.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["stage:early", "context:compensation-design"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-009",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Create a clear and compelling mission that unites your team and aligns their efforts. The mission should be specific, measurable, achievable, relevant, and time-bound. Communicate it regularly.",
    "rationale": "People need more than salary to be motivated—they need a sense of purpose. A compelling mission attracts talent who believe in the cause and creates cohesion. Cults have too little, consultancies have too much diversity.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Hiring",
    "applies_when": ["context:team-building", "stage:early"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  },
  {
    "id": "zero-to-one-heuristic-010",
    "source": "Zero to One",
    "type": "Heuristic",
    "purpose": "Evaluate",
    "claim": "Seek input from others but ultimately trust your own judgment and stay true to your vision. As a founder, success depends on making decisions based on your own beliefs and convictions.",
    "rationale": "Founders possess distinctive traits and vision that others lack. While feedback is valuable, consensus-driven decisions often lead to mediocrity. The best founders balance input with independent thinking.",
    "lens": ["Business"],
    "level": "Operating",
    "dimension": "Prioritisation",
    "applies_when": ["role:founder", "context:decision-making"],
    "strength": "Medium",
    "evidence_grade": "Secondary"
  }
]

